[
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=42",
    "title": "Pregnant and worried",
    "author": "Pregnant Worried",
    "content": "I am 8 months pregnant and worried about delivering my baby in a hospital.  My elderly parents live in the house with me.   Do you have any advice? ",
    "replies": [
      [
        {
          "reply_content": "Thank you for your post. Being pregnant during this time can be very worrisome. Please note that we cannot provide any medical recommendations about your pregnancy, but most definitely can provide some suggestions on managing some of the anxiety you may be feeling. Coming up with a coping plan to strengthen your resilience and reducing the impact of this stressful situation might be very helpful. This can include reaching out to your support systems, making a daily routine for yourself, and practicing relaxation techniques. It is important to be aware of the thoughts we are having, the what ifs, which often can add more fuel to our worries. Think of difficult or challenging situations you have an encountered that you were able to manage. Even if things werent perfect, what did you do to cope with the situation? If you are worried about the health of yourself and/or your baby, consider reaching out to your family physician for advice on sanitation and extra precautions that should be put in place during this time. Please see the Coping with Stress and Anxiety section of our website for more information: https://www.camh.ca/covid19",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=47",
    "title": "Supports for Parents/Caregivers",
    "author": "boymom 18",
    "content": "Just thought I'd share an excellent FREE resource I came across for parents and caregivers with young children:  #FromFearToHope: A Parent's Guide to to Supporting Children's Mental Health During the COVID-19 Pandemic https://otherlifelessons.com/products/fromfeartohopeworkbook I have used this workbook with my own boys (age 4 and 6). It made for a great activity to keep them busy (definitely needed right now because I'm working from home!) but was also really helpful for me. I was able to see how this situation is impacting both of them and now I feel better prepared to support their mental health needs.  I'm curious to hear other parent's or caregiver's experience using this resource? Was it helpful? ",
    "replies": [
      [
        {
          "reply_content": "Thanks for this post boymom! Yes, it would be great to hear if other parents or caregivers have used this resource before? Thanks for sharing!",
          "sub_reply_content": "In reply to COVID19 Moderator Re: Supports for Parents/Caregivers by boymom 18 - Friday, 27 March 2020, 3:08 PM You're welcome! Happy to help any way I can :) !    "
        }
      ],
      [
        {
          "reply_content": "You're welcome! Happy to help any way I can :) !",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=43",
    "title": "Worried about going outside when I need to run errands",
    "author": "NotJessica Jones",
    "content": "I'm feeling a lot of anxiety about going out to run necessary errands like picking up medication and groceries. Is there a good resource that talks about how to do this safely? I've looked into delivery but it was expensive.",
    "replies": [
      [
        {
          "reply_content": "Yeah I've been pretty worried about that too. There's still a chance I can catch it without realizing. I'm trying to follow the rules but I feel powerless!",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "Thank you for your post NotJessica Jones and Tony Stark. Going out to run necessary errands during this time can be very anxiety-provoking. I am happy to hear that you want to take precautions and find ways to safely purchase your medication and groceries in-person, since the delivery option is not for everyone. Here are some tips: (1) social distancing, (2) good hand hygiene and (3) try running your necessary errands during off-peak hours. Good hand hygiene is very important and social distancing is proven to be one of the most effective ways to reduce the spread of illness during an outbreak. While you are running necessary errands, keep a distance of at least 2 arms lengths (approximately 2 metres) from others, as much as possible. You can find more information about social distancing and hand hygiene here: https://www.canada.ca/content/dam/phac-aspc/documents/services/publications/diseases-conditions/social-distancing-infograph/social-distancing-infograph-eng.pdf . Hope this helps!",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=49",
    "title": "Talking to family/friends about social distancing",
    "author": "golden 001",
    "content": "How should I go about talking to loved ones (especially older family members) about social distancing who seem to not be taking it seriously? I want them to understand the importance of social distancing while also being sensitive to their concerns. I think they understand that social distancing means avoiding public spaces but whats missing is that it also means not going to visit a friend/invite people over.",
    "replies": [
      [
        {
          "reply_content": "Thank you for your post. I appreciate that you are willing to share this with us. I understand that you are concerned for the well-being of others, and it seems you want your family members to understand it's importance. It's imaginable that others are going through this as well. However, many people react differently to situations like the COVID-19 pandemic. It is important to try to understand that other people might be more or less worried and concerned than we are. Know this, though, can be stressful. To begin, you can provide accurate and up-to-date information about COVID-19 on Health Canada's website or from the World Health Organization. Having this reliable information might be a start to discussing this with your family members, especially in regards to social distancing.  Next, try approaching and listening to individuals who are either too concerned/not very concerned. Perhaps their reactions might be one of their own ways of coping with the pandemic.   It's important that we always check-in with ourselves to see whether another person's concern is causing us stress, anxiety, or some form of distress. If so, try maintaining a balance with these individuals in order to ensure you're coping well.",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "Yeah I was struggling with a similar dilemma, I'm glad to hear I'm not alone in not wanting to sound like a nag but also trying to contribute to the necessary communal empathy we all need to curate",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=46",
    "title": "Stressed about going to work",
    "author": "Dreamer 85",
    "content": "Because of the nature of my job I am not able to work from home. I live with my husband and 2 kids, as well as my 90 year old mother and I am worried about spreading any germs to them. Does anyone have advice on how to keep safe while still going to work? This has been so stressful and makes it hard to even concentrate on my job. ",
    "replies": [
      [
        {
          "reply_content": "Hi Dreamer 85, thank you for sharing your valid concerns with us here today. It may be stressful to not be able to fully concentrate at work because you are concerned for your familys health and safety. Along with practicing good hygiene and social distancing, here are some additional tips on how to keep safe at your workplace: https://www.who.int/docs/default-source/coronaviruse/getting-workplace-ready-for-covid-19.pdf. It can also be helpful to have a conversation with your manager/coworkers so that everyone can work together to keep your work environment safe. Hope this helps and thanks again for your post! If you have the opportunity to work from home, feel free to check out this post about working from home: https://covid19.camhx.ca/mod/forum/discuss.php?d=41#p88",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=50",
    "title": "Paradise Cinema Hosting Virtual Movies",
    "author": "Dorothy Vallens",
    "content": "Hello hello! A neat resource to allow one to take a break from typical Netflix Programming.  https://nowtoronto.com/movies/features/paradise-theatre-host-virtual-screenings/",
    "replies": [
      [
        {
          "reply_content": "Thank you Dorothy Vallens for sharing this with us all. Paradise's virtual movies sounds great; I may even check it out myself!",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=41",
    "title": "Family Workspace Stress",
    "author": "At Home",
    "content": "I'm stressed having my family around all the time while working, they keep coming into my workspace. How do I manage this? ",
    "replies": [
      [
        {
          "reply_content": "Thank you for your post! It seems like having your family around all the time is stressful. At times like these, when our schedules or lives suddenly change, it can be quite difficult to manage. Also, know that feeling stressed during these changes are quite normal, but it can still be overwhelming. We suggest finding time to speak with your family to decide when it's appropriate for them to come into your workspace and when you require your space so that you can get your work done. Perhaps you can also make a small routine for yourself, where you take some alone-time breaks during the day. Also, practicing some mid-day relaxation can help you cope with some of the stresses you are experiencing.  Here is a great resource on stress and anxiety to check out, which might be helpful.",
          "sub_reply_content": "In reply to COVID19 Moderator Re: Family Workspace Stress by Tony Stark - Friday, 27 March 2020, 12:55 PM Thank you for this resource, it's very helpful!     In reply to COVID19 Moderator Re: Family Workspace Stress by At Home - Friday, 27 March 2020, 1:03 PM Thank you for the advice and the resource! I think making a small routine will be helpful for me, I will try talking to my family later today :)    "
        }
      ],
      [
        {
          "reply_content": "Thank you for this resource, it's very helpful!",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "Thank you for the advice and the resource! I think making a small routine will be helpful for me, I will try talking to my family later today :)",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "I agree! This has been a huge challenge for me too. Especially having the line between work and home blurred now. Keeping the boundary clear and not burning out will be tough.",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=48",
    "title": "Getting Through",
    "author": "Chocolate Chip",
    "content": "There have been so many changes in such a short time. Im trying to stay positive but it gets harder the longer time goes on. I have my own things to deal with, but then Im also feeling mentally drained from trying to be caring for my friends and family who are being laid off work and having anxiety about what they should and shouldnt do to prevent getting or spreading the virus. Im finding that a few things are helping me, like: trying to remind myself of the silver linings or the things I am grateful for, connecting with friends through social media or texting, watching dog videos. I limit how much news I'm watching, and try to find videos that have nothing to do with what we are going through. The 30-60minutes of distraction have been such a relief. Ive had to stop clicking on COVID memes on social media too because I was feeling so overwhelmed and sad. Now I click on cute animal posts or posts about my favourite shows. Luckily Instagram is intuitive and now my feed is a bit better for my mental health. I also try to get some sunshine (near a window, by the door, or short walks) when I can.",
    "replies": [
      [
        {
          "reply_content": "I appreciate that you are willing to share this with us. What strikes me here is how many times you tried to find useful coping strategies, kudos to you! Those are all great suggestions. You show a lot of strength and determination by searching for coping strategies that help you. Thank you for sharing :)",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "I am also thinking of the silver linings at this time. We have power, water, heat, food and internet and some mode of transportation and gas for those who drive. I can't imagine life without one of these things let alone all of them. I have been doing Spring cleaning early and this feels good! stay safe and healthy!",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=45",
    "title": "Effects of Social/Physical-Distancing on Mood",
    "author": "Alone Worried",
    "content": "As an individual living with depression, I am quite worried about how my mood will be affected during this time when I am distanced from my friends and family.  What can I do to be proactive about this?",
    "replies": [
      [
        {
          "reply_content": "We thank you for your post. Being isolated can be very lonely and can have a big effect on your mood. One thing to remember is to recall what has previously worked for you in the past that helped manage some of your depressive symptoms. Many of those strategies you can still rely on! Although they might need to be tweaked. A common challenge is that times like these can disrupt routines; people may stop the activities they use to keep well (e.g., exercise, hanging out with friends) and engage in activities that can make things worse (e.g., stop talking to friends and family altogether). It is helpful to be aware if you are engaging in activities that are making your mood worse. It might be helpful to remind yourself that you can handle what you might be going through, and that if you feel you need support, you can reach out to family, friends, colleagues or professionals. Try to designate a few people you would reach out to if you feeling very lonely one day. This might increase likelihood that you reach out. Also, creating a schedule with your friends and family on regular phone check-ins and video chats might be helpful. This can help you feel like you are still among your close friends, even if from a distance. Remember, social distancing does not mean you should break off all contact from loved ones. Being alone can lead to spending too much time thinking about the current situation, resulting in increased stress and anxiety. It can be helpful to connect with people who are a positive influence when you are feeling stressed. For extra information, please visit our website: https://www.camh.ca/covid19",
          "sub_reply_content": "In reply to COVID19 Moderator Re: Effects of Social/Physical-Distancing on Mood by Patricia Hayman - Friday, 27 March 2020, 4:12 PM I have begun to take 15 mins of my day to meditate to deal with the added stress of this current situation. This maybe helpful to others as well. Thank you    "
        }
      ],
      [
        {
          "reply_content": "I have begun to take 15 mins of my day to meditate to deal with the added stress of this current situation. This maybe helpful to others as well. Thank you",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "I am not sure if I have depression too. I have been feeling really low and sad these days and it's hard to get up in the mornings with everything going on. Does that mean I could possibly have depression?",
          "sub_reply_content": "In reply to ihave aquestion Re: Effects of Social/Physical-Distancing on Mood by COVID19 Moderator - Friday, 3 April 2020, 12:50 PM Hi ihave aquestion, thank you for sharing your valid concern with us here.  Please note that we are unable to provide any clinical diagnosis. If you are worried about your mental health or have specific questions, consider reaching out to your family physician for advice on what you might be feelings and how long it has been going on.  I hear you. All the recent changes and the uncertainty can cause stress and anxiety because of its disruption to normal life as well the sudden overflow of information and attention on the topic. I recognize it is not always easy to share this, and you show a lot of strength by telling us your concerns. If you feel like it, you can check out this website for evidence-based tips, tools & information to help you manage these feelings and your overall mental wellbeing    "
        }
      ],
      [
        {
          "reply_content": "Hi ihave aquestion, thank you for sharing your valid concern with us here.  Please note that we are unable to provide any clinical diagnosis. If you are worried about your mental health or have specific questions, consider reaching out to your family physician for advice on what you might be feelings and how long it has been going on.  I hear you. All the recent changes and the uncertainty can cause stress and anxiety because of its disruption to normal life as well the sudden overflow of information and attention on the topic. I recognize it is not always easy to share this, and you show a lot of strength by telling us your concerns. If you feel like it, you can check out this website for evidence-based tips, tools & information to help you manage these feelings and your overall mental wellbeing",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=59",
    "title": "Stressed about parent in nursing home",
    "author": "Brooklyn 56",
    "content": "Im in a high state of anxiety about my 97-year old mother, who is in a nursing home in Dallas, Texas, thousands of miles from me (I live in Toronto). My sister, who lives in Dallas, was a daily visitor until the COVID-19 precautions were put in place, and I have been making regular trips to Dallas for many years now. (I had to cancel the flights I had booked for this months visit.) In this new world were in, my sister and I are completely cut off from our mother except for telephone calls (on which she cant hear us) during which she expresses her astonishment at the scale of this crisis and her fear that shell never see us again before she dies. Its heartbreaking. I find myself crying all the time - I cant stop thinking of her. I try to meditate, do mindfulness exercises, focus on my work, etc, but Im still crying. ",
    "replies": [
      [
        {
          "reply_content": "Hi Brooklyn 56, thank you for openly sharing this difficult situation you and your sister are in; it is heartbreaking. It is certainly normal to cry and feel worried about your mother and it can be stressful not to be able to visit her in the nursing home during this time. You may want to explore alternative safe ways to stay connected if she cannot hear you on the phone (e.g., some hospitals offer the email-a-patient service, where you can submit a message online and the staff will deliver it to patients the next day).   I am glad you are trying different strategies to help you cope, that shows a lot of strength and determination on your end. It can be helpful to reach out to loved ones for support, and if you feel like you still are not coping well, you may need extra support from your family doctor or other health professional.  You can also visit www.camh.ca/covid19 for more resources, which I hope are helpful to you.",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=62",
    "title": "Working and home schooling",
    "author": "Blueberry 14",
    "content": "I am having difficulties with trying to work from home full time and support my child in homeschool. My child needs extra support in general and I don't want them to fall behind as they were not doing very well in school before, either. They are very smart, but can't focus and requires alot of attention. We are working with doctors on a diagnosis, but in the meantime I need to do my work from home to get paid, and keep educating my child. I am doing 2 full time jobs at the same time. I am grateful for the income, but not handling the stress as well as I'd like, and want to support my child as much as possible. I also struggle with general anxiety and bipolar disorder.",
    "replies": [
      [
        {
          "reply_content": "Hi Blueberry 14, thank you for expressing your concern here today. It must be difficult trying to handle two full-time jobs while also trying to homeschool your child. You clearly care a lot about your childs education and want whats best for them. The COVID-19 pandemic has placed heavy new pressures on parents to teach, entertain, reassure and guide their children more than they ever had to before. The important thing is that you are trying your best. Judy Arnall (President of the Alberta Homeschool Association) said: Kids are born learners. So dont worry, dont panic about keeping up their curriculum and education. Feel free to check out tips on how to help yourself and your child during this time: https://www.covidwithkids.org/ It is also important that you take care of yourself during this time as well. It can be helpful to reach out to loved ones for support, and/or your family doctor or other health professionals for additional support if required. Hope this helps!",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=65",
    "title": "Keeping the Custodial staff safe",
    "author": "Always Mom",
    "content": "There has been much legitimate attention paid to the shortage of protective gear for medical and nursing staff. But  the people who clean those contaminated spaces where infected patients have worked or visited also cannot get protective gear. They are at risk every day and nobody has even noticed. Nobody is ordering a plane load of gear for them.  One of them is my child and I fear for their life.  This person Works in a large site that houses numerous essential businesses and government offices.  And they cant get  protective gear to clean any of those spaces, even  contaminated sites .  Unionized employees have the right to refuse this unsafe work, but  management  , maybe not.  Quite frankly, without custodial staff in every space occupied by people, all of the containment  strategies we are currently using  fail, yet these people are on the  job with minimal or no protective gear every day.   This mum is scared and helpless! ",
    "replies": [
      [
        {
          "reply_content": "I strongly advise you to take action and write to your Councillor. Here is the feed from what I wrote to mine today:  Hello Councillor Layton:  Could you kindly read through the feed here and understand that ALL shared residences - condos, duplexes, triplexes, etc need your direction at this time regarding tenant safety. My specific concerns herein are with regard to:  1. Cleaning safety and efficacy, 2. Frequent guests whom are not tenants or 'health workers/higher risk group assistants or helpers\", and almost most importantly - 3. Second hand smoke.  Thank you for your assistance, care and attention in advance.",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "I've also been going back and forth with my landlord regarding this and that is what I forwarded to the Councillor along with these helpful links:  https://www.canada.ca/en/public-health/services/publications/diseases-conditions/cleaning-disinfecting-public-spaces.html   COVID-19: cleaning in non-healthcare settings https://www.gov.uk/government/publications/covid-19-decontamination-in-non-healthcare-settings/covid-19-decontamination-in-non-healthcare-settings  https://www.nytimes.com/2020/04/03/realestate/coronavirus-manhattan-co-op.html  https://www.nationaljewish.org/conditions/health-information/smoking-and-tobacco-use/secondhand-smoke",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "Please learn how to make bandana masks for her and ensure she wear disposable gloved and some kind of apron that is bagged for 72 hours after each cleaning job and washed in soap and hot water.  https://www.theguardian.com/us-news/2020/apr/06/how-to-make-no-sew-face-mask-coronavirus",
          "sub_reply_content": "In reply to Duchess of Toronto Re: Keeping the Custodial staff safe by COVID19 Moderator - Tuesday, 7 April 2020, 4:28 PM Hi Duchess of Toronto: Thanks so much for providing this information to Always Mom's post and our discussion board community. It looks like you have done some excellent research, and can provide lots of helpful information!   Here are some other helpful resources on:  Cleaning/Disinfecting: https://www.publichealthontario.ca/-/media/documents/ncov/factsheet-covid-19-environmental-cleaning.pdf?la=en  CDC Cleaning Guidelines (with suggestions for custodial staff): https://www.cdc.gov/coronavirus/2019-ncov/community/organizations/cleaning-disinfection.html  Hope this helps!    "
        }
      ],
      [
        {
          "reply_content": "Hi Duchess of Toronto: Thanks so much for providing this information to Always Mom's post and our discussion board community. It looks like you have done some excellent research, and can provide lots of helpful information!   Here are some other helpful resources on:  Cleaning/Disinfecting: https://www.publichealthontario.ca/-/media/documents/ncov/factsheet-covid-19-environmental-cleaning.pdf?la=en  CDC Cleaning Guidelines (with suggestions for custodial staff): https://www.cdc.gov/coronavirus/2019-ncov/community/organizations/cleaning-disinfection.html  Hope this helps!",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=44",
    "title": "Nutrition and exercise",
    "author": "Cast Away",
    "content": "Any advice for someone who wants to stay active, yet has trouble avoiding that last bag of chips?",
    "replies": [
      [
        {
          "reply_content": "Thanks for your post! Staying healthy seems to be important to you. Physical activity is a great way to reduce stress and anxiety, and improve our mood and overall health. We can definitely provide you with some good tips on staying active and healthy during this time. Creating a routine schedule might be a great place to start. This can help increase your motivation. Also, try doing a workout that you enjoy, this will help motivation even more. For example: talk on the phone with someone or listen to your favorite music while out for a walk. Cravings for foods that arent very healthy is quite normal, too. Being aware of when you crave these foods is helpful if you want to reduce, e.g., when youre stressed, bored, or anxious. Perhaps you can add in a different option when you notice you have a craving, such as eating an apple, drinking a glass of water, or taking a small walk outside for fresh air.",
          "sub_reply_content": "In reply to COVID19 Moderator Re: Nutrition and exercise by Cast Away - Monday, 30 March 2020, 5:52 PM Thanks for the reply. Also saw this article on ESPN about physical activity. It might help: https://www.espn.com/espn/otl/story/_/id/28968781/how-stay-fit-safe-coronavirus-pandemic    "
        }
      ],
      [
        {
          "reply_content": "Thanks for the reply. Also saw this article on ESPN about physical activity. It might help: https://www.espn.com/espn/otl/story/_/id/28968781/how-stay-fit-safe-coronavirus-pandemic",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "I have zero motivation to stay active these days. I feel like all I do is stress-eat to be honest :(",
          "sub_reply_content": "In reply to ihave aquestion Re: Nutrition and exercise by COVID19 Moderator - Friday, 3 April 2020, 1:07 PM Thank you for sharing this with us. I see where you are coming from. It sounds like staying active is something quite important for you and it has been a challenge for you to maintain it.  At times like these, when our schedules or lives suddenly change, it can be quite difficult to manage actually and to tap into our motivation. In fact, feeling this way during these changes is quite normal and it matters to acknowledge our feelings and give ourselves the space to experience them. Perhaps, you can consider some of the recommendations we shared above was well as this article Cast Away has suggested regarding staying fit during these times.     "
        }
      ],
      [
        {
          "reply_content": "Thank you for sharing this with us. I see where you are coming from. It sounds like staying active is something quite important for you and it has been a challenge for you to maintain it.  At times like these, when our schedules or lives suddenly change, it can be quite difficult to manage actually and to tap into our motivation. In fact, feeling this way during these changes is quite normal and it matters to acknowledge our feelings and give ourselves the space to experience them. Perhaps, you can consider some of the recommendations we shared above was well as this article Cast Away has suggested regarding staying fit during these times.",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "I hear you on the chips! I end up eating in front of the TV while bingeing a show, and it gets to the point where I'm just mindlessly eating. What helps is if I transfer the snacks to a different container like a bowl or something, and leave the chips in the kitchen cupboard. That way I've got some portion control, and if I want more, I have to willfully go and get it :)  As for exercise and activity, I walk my dog several times a day (on leash and I keep well away from others, sometimes crossing the street if someone else is approaching on the sidewalk), and I just grabbed Just Dance on sale for my console which at least gets us moving.",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "Don't buy chips. I don't buy them on my BIG grocery shops. I only buy what I healthfully need for 1-2 weeks. Always make a shopping list so nothing else sneaks into the cart. If you are craving salty foods, it could mean you are dehydrated - so try having a big glass of water as a distraction first and foremost. It could also mean your adrenals are dealing with a lot of stress - LOL Check out my new category on Meditation and Stress Relief. I just put a few simple techniques in there to help reduce stress. GOOD LUCK!",
          "sub_reply_content": "In reply to Duchess of Toronto Re: Nutrition and exercise by ihave aquestion - Wednesday, 8 April 2020, 8:41 AM Yeah the shopping list really helps me too. If I don't buy it, it's \"out of sight and out of mind\". But sometimes I let myself buy a small snack as a nice treat :) Ooo I will try to the drinking water strategy, thanks for sharing that!    "
        }
      ],
      [
        {
          "reply_content": "Yeah the shopping list really helps me too. If I don't buy it, it's \"out of sight and out of mind\". But sometimes I let myself buy a small snack as a nice treat :) Ooo I will try to the drinking water strategy, thanks for sharing that!",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "Yes. What I do is play a mind trick on myself. While many people are binge-eating and stress-eating, I am saying to myself that I will actually be LOSING weight during this lockdown, not gaining it. Feeling like I am doing something different to what the majority of people are doing is a motivator for me, personally in this department. When I last went grocery shopping, I bought about 10 apples. Whenever I feel like my usual croissant or carb snack in the morning, I eat an apple instead and I'm full for a few hours. I also bought lots of nuts and cheese. Just think that you will be \"going against the grain\" during this period, as in, you won't be binge-eating or eating unhealthy stuff.  I would also suggest the classes on the Wellbeats app, if you are a member of the Wellness Centre. The classes are pretty good and there is a great variety!",
          "sub_reply_content": "In reply to Guitar Girl Re: Nutrition and exercise by COVID19 Moderator - Tuesday, 7 April 2020, 7:04 PM Thanks for the post Guitar Girl! Those are some great suggestions to keep yourself healthy. Keep up the motivation! :)    "
        }
      ],
      [
        {
          "reply_content": "Thanks for the post Guitar Girl! Those are some great suggestions to keep yourself healthy. Keep up the motivation! :)",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=52",
    "title": "Staying Connected",
    "author": "girl mom",
    "content": "It can be really challenging to feel connected during times like this. Reaching out to those that may not have as many supports around and scheduling phone calls or video chats have made a really big difference. I have been using the Houseparty app to have video chats with multiple people at once and its been great!",
    "replies": [
      [
        {
          "reply_content": "Thank you girl mom for your insightful post. The video chat app is a great idea, thanks for sharing it with us!",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "How does the app work? How many people can join at once?",
          "sub_reply_content": "In reply to ihave aquestion Re: Staying Connected by girl mom - Monday, 6 April 2020, 10:19 AM You would need to download the app. Once you have created an account, you just add your friends (once they have accounts as well). Then, when you want to have a chat, you request that they join your room and they can pop in. You can have up to 8 people in one call. Has been working great for me and my family!     In reply to girl mom Re: Staying Connected by ihave aquestion - Wednesday, 8 April 2020, 9:13 AM This is super helpful, thank you!    "
        }
      ],
      [
        {
          "reply_content": "You would need to download the app. Once you have created an account, you just add your friends (once they have accounts as well). Then, when you want to have a chat, you request that they join your room and they can pop in. You can have up to 8 people in one call. Has been working great for me and my family!",
          "sub_reply_content": "In reply to girl mom Re: Staying Connected by ihave aquestion - Wednesday, 8 April 2020, 9:13 AM This is super helpful, thank you!    "
        }
      ],
      [
        {
          "reply_content": "This is super helpful, thank you!",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=57",
    "title": "Creative Quaratining",
    "author": "Harbir Parmar",
    "content": "I know a lot of people are trying to find cool and unique ways to occupy there time during the quaratine.   Our anniversary was coming up and we obviously couldn't do go out and celebrate so we decided to do something creative at home instead. We took some of lights from the holidays, old sheets, burlap string, some good ol' elbow grease, moved our bed infront of the TV and built ourselves a fort.   It was so much fun and exciting that it felt as if anything else we had planned wouldn't be able to top this. With that being said, we decided to keep things interesting by creating new and exciting ideas every Friday to have something to look forward to and at the same time make this period that much more memorable. If anyone else has any ideas please share because we'd love to hear them.",
    "replies": [
      [
        {
          "reply_content": "Wow kudos to you and your wife for being super creative for your anniversary! It's really nice that you both have something every week to help the days go by.",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=61",
    "title": "Maintaining Progress while feeling Overwhelmed",
    "author": "Elephants Rock",
    "content": "I feel like I can't escape the news or information about what is happening outside of my control. I'm trying to avoid getting depressed again but it's very hard. I'm using all of my MCBT techniques and it helps until I get the next news alert from a friend, family member, or google. How much information is healthy at this point?  I'm just really overwhelmed. I feel myself ruminating and I am not sure how to stay mentally healthy during this time. Am I not doing enough because I'm not baking, exercising, cooking, working, learning a language, painting, and learning an instrument? I just want to maintain the progress I've made. ",
    "replies": [
      [
        {
          "reply_content": "Hello Elephants Rock,  Thank you sharing with us what you are going through. I recognize that is not always easy.  If youre noticing that your mental health is significantly exacerbated due the current circumstance, which is perfectly understandable, its always good to check in with your doctor or therapist to make sure that you are getting the support that you need and deserve.  With that being said, I see that you are proactively taking the initiative to manage how you are feeling by implementing specific learned techniques and strategies. So, kudos to you for finding the motivation for that! If you notice old patterns of feelings revealing themselves, please remember that that is perfectly normal with all the changes that are taking place. Progress is not linear and that is okay.  You already recognize what is leading you to feel overwhelmed, and that is excellent! So perhaps you can explore strategies to manage those triggers. For example, limiting the time you check the news, turning off the news notifications for periods of time, engaging in other activities to take your attention off of the current mood like for example finding a relaxing 5-minute video on YouTube, watching an interesting documentary, or just going for a walk!  You are certainly doing your best. I recognize there might be an added unnecessary pressure of engaging in productive activities. However, remember to engage in what feels aligned with you and what you have the headspace for, without putting extra pressure on yourself.  Keep doing what you are doing! And, if needed, you can find here some extra tips, tools, and information on how manage your overall mental wellbeing",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "At this point, little information is helpful in my opinion...get the main bits and pieces from your family/friends that you need to know, and that will prevent you from getting overwhelmed. At this point, we're all lost, and trying to figure this out together. As long as you're trying to keep your mental health ok, you're doing more than enough for yourself!",
          "sub_reply_content": "In reply to Deleted user Re: Maintaining Progress while feeling Overwhelmed by COVID19 Moderator - Wednesday, 8 April 2020, 10:03 AM Thanks for your post. You're right, while staying informed is helpful, too much information may not provide extra benefit. Limit checking sources to once per day or less if you can. This includes reading or listening to news stories about COVID-19. Even though things are shifting rapidly, daily changes are not likely to affect how you should manage your risk. Feel free to check out this resource for more information: http://www.camh.ca/covid19    "
        }
      ],
      [
        {
          "reply_content": "Thanks for your post. You're right, while staying informed is helpful, too much information may not provide extra benefit. Limit checking sources to once per day or less if you can. This includes reading or listening to news stories about COVID-19. Even though things are shifting rapidly, daily changes are not likely to affect how you should manage your risk. Feel free to check out this resource for more information: http://www.camh.ca/covid19",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=72",
    "title": "Seeing or talking to Doctors regularly?",
    "author": "Shark Attack56",
    "content": "Just a question. Wasn't sure where to turn onto ask..I see a psych doctor at Camh regularly  for counselling and meds. Since Covid has started I have not heard from them at all. I emailed once to reach out, but no response and with them being my only support I am feeling left behind and struggling. I heard a few people from programs I have been in that their doctors/workers have reached out to check on them and I am just wondering is this the norm? Are doctors emailing and calling to checking on patients? Or is this something not to expect? Are you all talking to your doctors or like me and left to fend alone? And if you are fending by yourself, how are you getting by?  *people say to reach out to your supports, but it's hard when you have 1 friend and 1 doctor for support*",
    "replies": [
      [
        {
          "reply_content": "Thanks for sharing your valid concerns with us today. It can be difficult not being able to access your regular health services during this time. Some healthcare providers are following up with their patients through virtual appointments, such as webcam and phone calls. I would suggest calling Access CAMH where they can provide you with more information about how you can get in touch with your provider. Simply call (416) 535 8501, option 2. It is certainly normal to feel alone during these times, especially if you are feeling like there is little support around you. This discussion forum is a great space to offer and receive support, so we encourage you to continue posting and sharing your experiences. It is also important to make sure you are taking care of yourself. I encourage you to visit our website http://www.camh.ca/covid19 for more information and resources on getting support and managing your health during the pandemic.",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=64",
    "title": "How much screen time?",
    "author": "Guitar Girl",
    "content": "I have a 4 year old and we have deliberately not exposed him to screens very much at all. He does not know how phones or iPads work.  He only started watching movies 3 weeks ago (we now do a family movie afternoon once per week).   On average, he watches about 15 minutes per day and this started back in November.  He is very articulate and communicates well with adults and children and is quite advanced for his age, verbally.  The problem now is, well...you all know what the problem now is.  I have meetings to attend and work to do.  He refuses to do any independent play and I don't get even 5 minutes to myself all day. He is an only child. My question is:  what have parents in a similar situation been doing about screen time during Covid-19?  I would love to hear how others' experiences of managing screen time during this stressful time.   Thank you. ",
    "replies": [
      [
        {
          "reply_content": "Hi Guitar Girl, thanks for sharing with us. It can definitely be challenging balancing working from home and caring for children all at once.  It sounds like minimizing your childs exposure to screen time is important to you. It can be helpful to create a daily routine with a list of activities that your child can engage in. Although they may not stay occupied for long stretches of time, it may help create blocks of time where you can get work done. Check out these resources for ideas, tips and support on coping with kids during the COVID pandemic.  https://www.covidwithkids.org/home  https://childmind.org/article/supporting-kids-during-the-covid-19-crisis/  https://justworks.com/blog/parents-working-from-home-during-covid-19-how-manage-the-workday  Practicing self-care and managing your own stress is also important during this time. It may be helpful to speak to your employer about your concerns so that you can work together to develop a potential solution (i.e. flexible hours, reduced workload etc.). You can also visit our web page on coping with stress http://www.camh.ca/covid19#coping.",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=73",
    "title": "Contact My Doctor",
    "author": "AD HD",
    "content": "How do I attain my Psychiatrist's email? I have concerns in regards to the medication I've been prescribed. Thanks",
    "replies": [
      [
        {
          "reply_content": "Hi there, some healthcare providers are following up with their patients through virtual appointments, such as webcam and phone calls. I would suggest that you call Access CAMH where they can provide you with more information about how you can get in touch with your provider. Simply call (416) 535 8501, option 2. We hope you get the care that you deserve!",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=74",
    "title": "Positive side of things?",
    "author": "Cactus 1994",
    "content": "I realize this is a hard time...it's a lot for many people. Including myself. I've been trying to genuinely focus on some of the positive things that have come from all of this. For example, I've noticed people enjoy being around others more (direct family). I see more kids on my street, and their parents actually playing with them. I see all the different pets on my street that I never have before, and I realize how happy they are to be outside with their owners. I notice the grass is getting greener, and some trees are beginning to sprout their flowers. I notice more squirrels, bunnies, and birds. I have separated myself from the news as much as possible. I've distanced more from social media. And I've kept more in contact with my friends and family. I've begun practicing yoga, going on runs, and caring for my plants. What positive things have you noticed?",
    "replies": [
      [
        {
          "reply_content": "Hi Cactus 1994! I agree, I see many more positive things too. Especially with spring coming along. Thinking of this stuff helps people get through these difficult times. It's not that we're necessarily ignoring what is going on, but we distribute how much we can worry about one thing, and make way for more balance in our life by thinking of the positives. Thanks for your post! I'm wondering if anyone else has noticed things like this as well?",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "Hey Cactus 1994, Ive noticed the same things youve listed above. More people are realizing the benefits of self care. This time has allowed them to appreciate simpler things in life that we might have taken for granted. With discussion with friends, more people are talking about the benefits of creating a good work life balance moving forward.",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=75",
    "title": "Anxiety",
    "author": "S Kau",
    "content": "Why do I feel more anxious about going to the grocery store than I do about going to work.... I'd rather be at the hospital working those frontlines than going to the grocery store.  Also how can some essential places still be open without providing PPE to them.. do employers know this is now community spread. ",
    "replies": [
      [
        {
          "reply_content": "Hi S Kau, thanks for sharing your thoughts with us. Kudos to you and all our frontline workers, your strength and efforts during this time are truly appreciated! Feeling anxious about going to the grocery store is certainly normal during the pandemic. While we cant always control the environment around us, we can take steps to reduce the risk and spread of infection, such as practicing good hand hygiene, social distancing and wearing a non-medical face mask when we cannot maintain proper physical distance (such as grocery shopping). For more tips on grocery shopping during COVID-19, check out this video   You may also find it helpful to access our webpage on managing anxious thoughts http://www.camh.ca/covid19#coping  Having questions about the use of PPE by essential employers is also understandable. The government of Canada has issued guidelines for workplaces/businesses to follow during the COVID-19 pandemic, including the use of PPE when necessary. You can check out their guidelines here: https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/guidance-documents/risk-informed-decision-making-workplaces-businesses-covid-19-pandemic.html",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=53",
    "title": "Work",
    "author": "Maria-Grazia Dragonetti",
    "content": "I work in the bank and we have plexiglasses now. Im worried this isnt enough and Im stressing Im at a high risk of exposure. Will I be safe if I wear a mask and keep my distance while working?",
    "replies": [
      [
        {
          "reply_content": "Thank you for your post and sharing your concerns. It is quite normal to feel worried and stressed during this time, especially as a front-line worker at a bank. By taking safe measures like keeping a distance and washing your hands often, you are doing your part in limiting the risk of exposure. Here's a resource that explains when and how to use a mask: https://www.who.int/emergencies/diseases/novel-coronavirus-2019/advice-for-public/when-and-how-to-use-masks",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "I work in an office, have locked the doors so customers have to call first. I have plexiglass up and I clean non stop. I wash and use hand sanitizer. I still stress and actually cry on the way to work and sometimes on the way home. There are days where I just want to leave and not open again. I do have 3 others still working with me that want to work and can only work if I stay. Havent slept properly in weeks, my stomach is in knots all the time. I find going for a little drive with the music blasting and forcing myself to sing with it really helps. By the end of the drive Im singing happily and forgetting whats going on for a little bit. So if you see a crazy person singing at the top her lungs and hurting your ears, you know its me lol",
          "sub_reply_content": "In reply to Maggie S Re: Work by COVID19 Moderator - Wednesday, 15 April 2020, 4:10 PM Hello Maggie Thanks for sharing how you are feeling about all of this. It looks like you are doing everything that we've been advised to do to reduce the risk of infection such as washing hands. The plexiglass is also an additional protective measure. So it sounds like your risk is actually pretty low. However, it's normal for some people to feel very stressed and anxious about this pandemic. It's good that you have some strategies that help support you like the music and singing to yourself - you actually made me laugh with your last statement. Do whatever works. I strongly suggest you check out the camh.ca/covid19 page for additional strategies that do help people. But sometimes people may need more support - don't forget to check out some of the additional resources on this page in case you want to call to talk to someone about how you are feeling. Remember that you are doing the best that you can and by taking the steps you have taken, you are reducing your risk significantly.    "
        }
      ],
      [
        {
          "reply_content": "Hello Maggie Thanks for sharing how you are feeling about all of this. It looks like you are doing everything that we've been advised to do to reduce the risk of infection such as washing hands. The plexiglass is also an additional protective measure. So it sounds like your risk is actually pretty low. However, it's normal for some people to feel very stressed and anxious about this pandemic. It's good that you have some strategies that help support you like the music and singing to yourself - you actually made me laugh with your last statement. Do whatever works. I strongly suggest you check out the camh.ca/covid19 page for additional strategies that do help people. But sometimes people may need more support - don't forget to check out some of the additional resources on this page in case you want to call to talk to someone about how you are feeling. Remember that you are doing the best that you can and by taking the steps you have taken, you are reducing your risk significantly.",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=76",
    "title": "Payroll",
    "author": "George Hockey",
    "content": "Will there be any additional financial supports or wage boosts for part time research analysts making under 2000?",
    "replies": [
      [
        {
          "reply_content": "Hi George Hockey, thanks for your post! Times like this bring a lot of questions about our job and financial support. Unfortunately, we are unable to provide you an answer to this question. Since this discussion forum is focused on Mental Health and COVID-19, maybe the best source would be your manager. If you would like any resources to deal with stress related to COVID-19 and finances, please feel free to post again or reply to your thread. Thanks again for posting.",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=77",
    "title": "Being pressured to work at the office",
    "author": "DotDot ExclamationPoint",
    "content": "Hi, Although my husband is currently working from home and has set up an excellent office for himself in the basement, his boss has been pressuring him to work from the office. My husbands team member was recently let go so he is in charge of training the new hire, which he is currently doing through phone calls, Skype and screen sharing. His boss believes that the new hire can be trained more efficiently in person, while still maintaining social distancing. My husband has repeatedly tried to explain to his boss that he doesnt feel safe going into the office and would rather train at home. The new hire feels the same way. Furthermore, in person training would still result in screen sharing since they would be sitting far apart.  My husband is feeling immense pressure as he is trying to balance training his co-worker and getting his own work done at a rate that is sufficient for his boss. On the other hand, if he goes into the office, he would only be putting his health and other peoples health at risk. For now his boss let him work from home this week, but will decide the outcome of next week based on his performance. How should he go about dealing with this situation?",
    "replies": [
      [
        {
          "reply_content": "Hi there, I am sorry to hear that your husband is feeling immense pressure from work. I can understand why it is important to him to minimize his own risk to his health and to others, during this time. I am happy to hear that his boss is allowing him and the new hire to trial training from home, and I hope it works out successfully. In the event that he has to return back to work, I would highly suggest that he review the COVID-19 Guidelines for Workplaces/Businesses and Employers created by Toronto Public Health with his employer/team, to help reduce everyones risk at his workplace: https://www.toronto.ca/wp-content/uploads/2020/03/9538-Fact-Sheet-for-Workplaces-Non-Healthcare_final.pdf. Hope this helps!",
          "sub_reply_content": "In reply to COVID19 Moderator Re: Being pressured to work at the office by DotDot ExclamationPoint - Friday, 17 April 2020, 6:54 PM Thank you! Yes that resource is very helpful!    "
        }
      ],
      [
        {
          "reply_content": "Thank you! Yes that resource is very helpful!",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=78",
    "title": "Feeling down",
    "author": "Cr R",
    "content": "Hello I am finding that due to the COVID 19 situation I am feeling down. I do struggle with ongoing depression but have been stable for a number of years. However I find my sleep patterns are being impacted where I want to sleep more then usual. Also I feel like crying a lot.  I'm trying to manage work and kids during this and finding some days to be difficult. ",
    "replies": [
      [
        {
          "reply_content": "Hi Cr R, thank you for your post today. Times like these can be very tough and this situation can make many people feel like they want to cry. Managing your work and kids during these times can also be difficult, but it sounds like youre trying your best and I applaud you for that. Try recalling which strategies helped you when you were feeling down in the past. You can rely on many of those strategies, although they might need to be tweaked a little. Also, keeping a consistent sleep schedule can help people get back into a routine as well.  It can be helpful to reach out to loved ones for support, and if you feel like you still are not coping well and crying very often, you may need extra support from your family doctor or another health professional. You can also visit www.camh.ca/covid19 for more resources, which I hope are helpful to you!",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "I find that forcing myself to go for a walk when I'm feeling sad can also help. Take the kids with you if you can or even better go by yourself to take a break! And cry if you have to - that usually makes me feel better. Nothing wrong with crying.",
          "sub_reply_content": "In reply to Mia Oripo Re: Feeling down by COVID19 Moderator - Monday, 20 April 2020, 7:05 PM Thanks for sharing these great suggestions, Mia! I agree, absolutely nothing wrong with crying, it can be helpful when we are feeling down and faced with difficult situations. However, if you are noticing that you are crying very often, you may need extra support from loved ones, your family doctor or another health professional.   For more tips on managing work and kids through COVID-19 feel free to also check out this discussion thread.    "
        }
      ],
      [
        {
          "reply_content": "Thanks for sharing these great suggestions, Mia! I agree, absolutely nothing wrong with crying, it can be helpful when we are feeling down and faced with difficult situations. However, if you are noticing that you are crying very often, you may need extra support from loved ones, your family doctor or another health professional.   For more tips on managing work and kids through COVID-19 feel free to also check out this discussion thread.",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=79",
    "title": "What do I do?",
    "author": "ihave aquestion",
    "content": "I am worried about going grocery shopping. It's causing me so much anxiety! I wear a mask and gloves but I still feel like I'm going to catch something and spread it to my family. I tried ordering online but the wait time is too long. What do I do?! ",
    "replies": [
      [
        {
          "reply_content": "Hi ihave aquestion - thanks for this post! This is a concern shared by others on the discussion board too. It sounds like you are doing all the right steps to keep yourself and your loved ones safe.   Some have found shifting their approach to shopping from a 'what do I want?' to 'what do I need?' helpful. Others have suggested doing big bulk shopping online (when a space is available!) and only going to the store for essentials when urgent, while they wait for their delivery.  There was a great discussion and video on best practices for shopping in the grocery store on our discussion board  you can get it by clicking here. I hope this helps!",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "I leave my groceries in the garage before bringing them in and then wipe them down with a Clorox wipe or rag with soap and water.",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=83",
    "title": "Staying Positive",
    "author": "n u",
    "content": "I think for a lot of people 2020 was supposed to be the year where everything changed for the better. It was supposed to be a year filled with new experiences, momentous changes and achieving lifelong goals. For me personally, I had this notion in mind that this would be the year where all the plans I laid out would come to fruition through diligence and honing in on the infinite potential that lies within. Then COVID 19 happened. It was an entirely unexpected, unpredictable left turn. Suddenly. all the strategies I had been working on to push my dreams into reality had to be reassessed, if not, put on the back-burner entirely. But even beyond that I knew that so many people around the world have been suffering indescribable losses far beyond my comprehension due to this pandemic. In a way this can be felt in the air around us.  As I've been attempting to adjust to this new routine, there have been ups and downs. An understanding that has helped me stay positive through all of this is realizing that sometimes the medicine that we need to heal us is often bitter. I think that being in isolation is forcing a lot of people to slow down and reassess their own priorities. In my case, it helped me stop and really strengthen my intentions as well as add more details to the goals that I had been visualizing. I only now understand how important this step is in my journey. If I look back at life, I know, beyond a doubt, that the most difficult experiences in my life became the catalyst through which I grew and changed for the better. I find solace in this awareness.  Another mental exercise that has helped me is practicing mindfulness. Just last night, I watched a lecture which said that mindfulness is not just breathing or meditating but it is the simple act of being present... entirely present. By this, it means to not focus on the future or the past but to simply soak in where you are right now. If you are eating a piece of fruit for instance, its to notice the fruits sweetness or the fact that you have a chair to sit in and a house that is warm. Perhaps its noticing that the room is quiet and you have time to think. This has deepened my sense of gratitude for the incalculable blessings that exist everywhere. I've also tried to take my previous goals and create micro-goals that I am actually able to work on while in self-isolation. These are just a few thing that have helped me. I hope everyone is staying safe and truly we are all in this together.",
    "replies": [
      [
        {
          "reply_content": "It sounds like you have really been able take this time to reflect and grow. Thank you for sharing this!",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "Wow this was so well articulated. Thanks for sharing this, I can't agree more with you!",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=58",
    "title": "Can time fly by?",
    "author": "summer girl20",
    "content": "I know were all eagerly waiting to see the number of cases of COVID-19 each day, sometimes every day can feel SUPER LONG..  I find myself wondering when all of this will end. So Ive started doing small things around my house in preparation for summer time (fingers crossed we get one!). In times of uncertainty, I find that I always need something to look forward to.. so I started packing away my winter + spring clothes, cleaning up the yard, spring cleaning etc.  choosing to focus on something positive and exciting has taken away the depressing reality of being stuck indoors. ",
    "replies": [
      [
        {
          "reply_content": "Hi summer girl20, thank you for your post. I'm happy to hear that you are staying productive and choosing to focus on something positive and exciting to help you get through this time!",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "hello and thank-you for your post! I also am doing Spring cleaning up the yard, decorating my front porch for Spring, getting planters ready (sure am hoping we can get plants this year) and will wash some windows this weekend. Thanks for the idea of summer clothes!! That one is on my \"to do list\" stay home and healthy!!",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "I think that is a great idea! You've inspired me to put out winter coats and boots in the basement and give our front door closet a clean.",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "This is great! I been doing small things around my house too each week (e.g., cleaning my closet, cleaning under my bed, organizing my kitchen cabinets etc.). I'm so happy I can finally do these things that I've been putting off for so long. What else are others doing?",
          "sub_reply_content": "In reply to ihave aquestion Re: Can time fly by? by COVID19 Moderator - Thursday, 23 April 2020, 2:44 PM I'm so happy to read these comments with great ways of being productive and staying positive in these trying times. Keep up with those positive spirits and continue to share it with others.    "
        }
      ],
      [
        {
          "reply_content": "I'm so happy to read these comments with great ways of being productive and staying positive in these trying times. Keep up with those positive spirits and continue to share it with others.",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=86",
    "title": "Neighbours not isolating",
    "author": "the dude abides",
    "content": "We, as most people, are trying to stay home as much as possible and have not had any visitors since all this began, nor have we gone to visit anyone. We couldn't even have a funeral for a recent close family member.  Our close neighbour (same building) has a constant flow of people in and out every day. Non essential visitors. Multiple people in a very small apartment. An apartment that the heating system is shared with our apartment (meaning we get to share the same air as a bunch of strangers).  Has anyone else had neighbours abusing/violating social distancing? What have you done about it, what CAN you do about it? ",
    "replies": [
      [
        {
          "reply_content": "Thank you the dude abides for sharing your thoughts with us today. First, I am very sorry to hear about your family member, my sincere condolences. It can be concerning to see neighbours violating social distancing measures when you are trying your best to stay home and avoid visitors. The Toronto Star recently shared an article, What should I do when I see someone ignoring social-distancing despite COVID-19. While we do not always know someone elses situation, the article suggests allowing individuals to explain the reasoning behind their actions, and avoid using accusatory language. You may also choose to call an authority figure (such as a bylaw officer) to avoid direct contact with the individual. For more tips and advice from experts you can read the article here: https://www.thestar.com/news/canada/2020/04/05/what-should-i-do-when-i-see-someone-ignoring-social-distancing-despite-covid-19.html  Has anyone experienced a similar situation? How have you responded?",
          "sub_reply_content": "In reply to COVID19 Moderator Re: Neighbours not isolating by the dude abides - Wednesday, 29 April 2020, 3:28 PM Thank you for your condolences, it is appreciated. Also thank you for the link, I'll have a look. We have a similar bylaw contact line and email address here in London.    "
        }
      ],
      [
        {
          "reply_content": "Thank you for your condolences, it is appreciated. Also thank you for the link, I'll have a look. We have a similar bylaw contact line and email address here in London.",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=89",
    "title": "Having to stay home",
    "author": "mya mya",
    "content": "I am a healthcare worker and took a leave of absence because of school closures. My husband has been working from home but wouldnt have been able to homeschool our kids. We live my my parents one of whom has hypertension and had a heart attack a few years ago. My siblings were very concerned about me going to work and putting my parents at risk. I feel tremendously guilty that I should have been working during this time and should have put my workplace first during this pandemic.  I do overcome this guilt and resentment ",
    "replies": [
      [
        {
          "reply_content": "Thank you for sharing your experience.  It sounds like you really value your work and it has been difficult for you to adjust to the choices you have had to make during this challenging time. Feelings like guilt and resentment can make it ever harder to cope with this situation, however these are also normal emotions that can help us make sense of things.  You seem to have a desire to help your community through your work, while also keeping your family safe by staying home. Either way, you seem to be doing what you can to help others, even if it is not in the way you had hoped.  Here are some resources that you may find helpful as you process the difficult emotions youve mentioned:  CAMH COVID and Mental Health: https://www.camh.ca/en/health-info/mental-health-and-covid-19  CMHA COVID Mental Health Tips: https://ontario.cmha.ca/news/cmha-offers-tips-to-support-mental-health-amid-concerns-of-covid-19-pandemic/",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=54",
    "title": "How long will this go on for?",
    "author": "Pauly P",
    "content": "I get we have to follow the rules now. But I'm getting stressed thinking about how long we have to do this for. What if we are still forced to stay home in the summer! ",
    "replies": [
      [
        {
          "reply_content": "I agree!! I don't want to stay inside during the summer...imagine we can't live life like we normally do. This is getting hard :(",
          "sub_reply_content": "In reply to Deleted user Re: How long will this go on for? by COVID19 Moderator - Thursday, 2 April 2020, 3:21 PM Hi Pauly P and Plant Lover, thank you for sharing your valid concerns with us. It can be stressful to think about how the pandemic is disrupting normal life, and not knowing how long this situation will last. Even though we are encouraged to maintain social distance, there are still ways to enjoy the warm weather as summer approaches. Consider stepping out for some fresh air or going on a walk/run. Physical activity is also a great way to reduce stress and improve your mood!  For more support on coping with stress during the pandemic you can also check out the resource here: http://www.camh.ca/-/media/files/camh_covid19_infosheet-challenge_worries-pdf.pdf?la=en&hash=C353ECA675B347D3F37EBCA7F0E25E5FEDC2413F    "
        }
      ],
      [
        {
          "reply_content": "Hi Pauly P and Plant Lover, thank you for sharing your valid concerns with us. It can be stressful to think about how the pandemic is disrupting normal life, and not knowing how long this situation will last. Even though we are encouraged to maintain social distance, there are still ways to enjoy the warm weather as summer approaches. Consider stepping out for some fresh air or going on a walk/run. Physical activity is also a great way to reduce stress and improve your mood!  For more support on coping with stress during the pandemic you can also check out the resource here: http://www.camh.ca/-/media/files/camh_covid19_infosheet-challenge_worries-pdf.pdf?la=en&hash=C353ECA675B347D3F37EBCA7F0E25E5FEDC2413F",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "Yes, I hear you. One thing I am doing is playing a trick with my mind. I am telling myself that we will be in lockdown until September at the earliest. Then when restrictions are slowly lifted before that, I will feel a sense of relief. But for now, my mental trick is: \"4 more months\", only to be elated when it's not. I can see however, that this might make the picture look even worse. But this mind trick is working for me--on most days.",
          "sub_reply_content": "In reply to Guitar Girl Re: How long will this go on for? by ihave aquestion - Wednesday, 8 April 2020, 9:08 AM I try to \"trick my mind\" but then the thought of being in lockdown until September causes me so much more anxiety! What do I do?     In reply to ihave aquestion Re: How long will this go on for? by COVID19 Moderator - Wednesday, 8 April 2020, 9:52 AM Hi ihave aquestion,  There is no one size fits all solution to how we cope with our current situation. There is no right or wrong way to feel about this situation, but there are thoughts that might make us feel worse or better. It might help to focus on what makes you feel better when possible. For example, is it more helpful to focus on just today? What do you normally do to feel better when your anxiety is high? And give yourself credit for trying to get through this! It's not an easy time, and your effort deserves to be recognized.  If you haven't seen this yet, you can find some more information about coping with anxiety during COVID-19 here: https://www.camh.ca/en/health-info/mental-health-and-covid-19    "
        }
      ],
      [
        {
          "reply_content": "I try to \"trick my mind\" but then the thought of being in lockdown until September causes me so much more anxiety! What do I do?",
          "sub_reply_content": "In reply to ihave aquestion Re: How long will this go on for? by COVID19 Moderator - Wednesday, 8 April 2020, 9:52 AM Hi ihave aquestion,  There is no one size fits all solution to how we cope with our current situation. There is no right or wrong way to feel about this situation, but there are thoughts that might make us feel worse or better. It might help to focus on what makes you feel better when possible. For example, is it more helpful to focus on just today? What do you normally do to feel better when your anxiety is high? And give yourself credit for trying to get through this! It's not an easy time, and your effort deserves to be recognized.  If you haven't seen this yet, you can find some more information about coping with anxiety during COVID-19 here: https://www.camh.ca/en/health-info/mental-health-and-covid-19    "
        }
      ],
      [
        {
          "reply_content": "Hi ihave aquestion,  There is no one size fits all solution to how we cope with our current situation. There is no right or wrong way to feel about this situation, but there are thoughts that might make us feel worse or better. It might help to focus on what makes you feel better when possible. For example, is it more helpful to focus on just today? What do you normally do to feel better when your anxiety is high? And give yourself credit for trying to get through this! It's not an easy time, and your effort deserves to be recognized.  If you haven't seen this yet, you can find some more information about coping with anxiety during COVID-19 here: https://www.camh.ca/en/health-info/mental-health-and-covid-19",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "Until the health officials feel satisfied with the curve of the virus that it is safe to , my trust is in them only , I have mixed emotions about going back to work",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=70",
    "title": "Great time for deep reflections!~",
    "author": "Gary Goodwin",
    "content": "Given the current situation, globally, we certainly are not alone regarding a disconnect from what was the norm not very long ago. However, for me, I've taken the opportunity to \"Look\" deeply within without any judgment whatsoever and to also appreciate what is right, like the sun, the rain, a blue sky, the clouds, flowers starting to grow, listening to sounds of nature, going for walks, reading a book etc. For many people they may in fact find it difficult doing \"No-thing\" , however, doing nothing is its own meditation and in fact is \"Effortless\". Riding the wave of life embracing it with all of our senses can invoke a real sense of freedom from what might have been the \"Norm\". This can be a time for reframing how we think and feel and improving lifestyles, taking breaks from information overload, and being present to what really matters. This could be a time for Clarity in our lives about what we actually need versus the things we may want. One thing for sure, many feelings and emotions are similarly felt regardless of what part of the Globe you reside we can all relate to Love, Support, Compassion etc.",
    "replies": [
      [
        {
          "reply_content": "Thank you for such an insightful post, Gary! It is refreshing to hear other perspectives. This is certainly giving me something to think about.. thanks for sharing!",
          "sub_reply_content": "In reply to a n Re: Great time for deep reflections!~ by Gary Goodwin - Wednesday, 8 April 2020, 3:12 PM You're sincerely welcome!~ :-D    "
        }
      ],
      [
        {
          "reply_content": "You're sincerely welcome!~ :-D",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "This is a great reminder, thank you! What are things we can do to help people around us? I want to help my neighbours, but I know for everyone's safety (and my own) I still have to keep a distance.",
          "sub_reply_content": "In reply to ihave aquestion Re: Great time for deep reflections!~ by COVID19 Moderator - Wednesday, 22 April 2020, 11:04 AM Thanks for your post Ihave aquestion. Wanting to help others while also maintaining everyone's safety is an important consideration.  Some possible suggestions could include: 1 -leaving some needed sealed items in a donation box in a common area (lobby if you're in a building or side-walk area). 2 - if you know there is a neighbor who could use a bit of help and may find it difficult to go out into the community you may consider offering to pick something up at the grocery store for them when you run your errand.  I'm curious to hear any suggestions that others may have.    "
        }
      ],
      [
        {
          "reply_content": "Thanks for your post Ihave aquestion. Wanting to help others while also maintaining everyone's safety is an important consideration.  Some possible suggestions could include: 1 -leaving some needed sealed items in a donation box in a common area (lobby if you're in a building or side-walk area). 2 - if you know there is a neighbor who could use a bit of help and may find it difficult to go out into the community you may consider offering to pick something up at the grocery store for them when you run your errand.  I'm curious to hear any suggestions that others may have.",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "This forces us to think of what we can correct in our lives mentally and physically and take courses online and spending time with your family",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=85",
    "title": "I need help, I have no supports",
    "author": "Cactus 1994",
    "content": "I miss my friends and can't see them anymore. I wish I had other ways to feel supported. What do I do?",
    "replies": [
      [
        {
          "reply_content": "Hi Cactus 1994  Thanks very much for your post. It can feel challenging keeping socially connected while maintaining social distancing practices. At the same time, reaching out to this discussion forum is one place you can connect with others and get support. As for your seeing your friends, technology gives us some more options for staying connected and seeing each other while we are apart - FaceTime, Zoom, Houseparty are a few examples. I'd love to hear what others have found helpful.",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "https://www.camh.ca/en/health-info/mental-health-and-covid-19  This is a link to mental help resources , hope this helps",
          "sub_reply_content": "In reply to scott stafford Re: I need help, I have no supports by COVID19 Moderator - Tuesday, 5 May 2020, 11:38 AM Hi scott stafford, thank you for sharing the resource with Cactus 1994.    "
        }
      ],
      [
        {
          "reply_content": "Hi scott stafford, thank you for sharing the resource with Cactus 1994.",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=92",
    "title": "Higher Risk = Higher Panic",
    "author": "Ethel Luna",
    "content": "Found out recently I'm at a higher risk of infection because of my medication. It's only every 6 months and the highest risk times are the days/weeks following a dose. Unfortunately my next dose is this week and my fear has gone through the roof. Having to commute to a clinic (thankfully not being done at the hospital) and sit through the administration of the medication which takes 5-6 hours and makes me feel exhausted and just crappy only to have to commute home, knowing my immune system was just partially obliterated and then waiting for a few weeks through the usual discomfort it causes hoping I didn't catch anything has had me completely wound up. Made worse by the fact that I need to go to downtown Toronto, to a hospital, to get a test done, a week after i get this medication given, I'll still be elevated risk and coping with the associated fear of the given circumstance is feeling overwhelming.",
    "replies": [
      [
        {
          "reply_content": "Hello Ethel, Thank you choosing to share this with us. You stress and feeling overwhelmed are completely justified given that you're dealing with health concerns amidst a pandemic that puts you at higher risk. This can really be a lot to deal with.  If you feel your health is being compromised, I strongly encourage you to bring up these concerns with with doctor to make sure you are getting the appropriate support and potentially even discuss alternative options.  And I do want to acknowledge the resilience and strength it takes to still be on top of your appointments and treatment despite everything that is going on. I recognize it is not easy. I encourage you to think back to strategies that helped you in the past when you were feeling overwhelmed. Those can be a good resources to rely on for coping.  You may also find it helpful to access these resources to help you manage the anxiety and stress: Interactive tools and tips for mental wellbeing during COVID19 A 6-session self help program for anxiety Another great resource is the Distress Centre to discuss how you are feeling. You can call them at 1-833-456-4566 (available 24/7) or text \"Start\" to 45645 (available 4pm-12am ET). It can be helpful to reach out to loved ones for support as well during such challenging times.  I hope you fid this helpful and I hope you stay safe and well",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=90",
    "title": "Feeling down",
    "author": "Cr R",
    "content": "Feeling down and there are days I feel as if I just want to sleep and forget about all of this. Work has been very difficult and I find myself having times that I feel like Im failing at everything. I feel hopeless at times. I know I should be getting out and walking but I cant seem to move right now. I want things to get back to normal but they arent. ",
    "replies": [
      [
        {
          "reply_content": "Hi Cr R thanks for posting here again. This situation can make many people feel down and it can make things like work feel more difficult than ever before. I am sorry to hear that you are feeling hopeless at times and dont feel like you are able to get out and go for a walk. It can be helpful to reach out to loved ones for support, and if you feel like you still are not coping well, its usually a good idea to get assistance from a family doctor, a counsellor or a crisis line. Just a reminder, this platform is not a crisis support service, but we do care about your safety. If you are in crisis, feeling suicidal, or need emotional support, please call the Distress Centre at 1-833-456-4566 or text 45645. If this is an emergency or an urgent matter, its important you get help right away, so please call 911 or go to your closest emergency room. I hope this helps!",
          "sub_reply_content": "In reply to COVID19 Moderator Re: Feeling down by Nothing Special - Saturday, 9 May 2020, 11:11 AM I am like this all of the time. I have gone to my local ER many times, only to be sent home. I am alone. Lost my family many, many years ago, and lost my second family through a divorce that is still ongoing. How do you feel any hope, when even the professionals are telling you that they aren't qualified to help you? I have C-PTSD, Major Depression, Agoraphobia etc. I would like to try CAMH as I know that I need an inpatient program, but would need someone to drive me there and not sure that I want to drive there, only to have them turn me away. I have huge issues using the phone, so that doesn't help. Tired of being turned down.     In reply to Nothing Special Re: Feeling down by COVID19 Moderator - Saturday, 9 May 2020, 11:40 AM Hi there, thank you for sharing your experiences with us today, you showed a lot of strength and courage by doing that. It can be discouraging not being able to get the help you need, but it seems like taking care of your mental health is important to you. There are many programs that may be able to offer you support either in person or over the phone/computer. If you are interested in accessing CAMH services, I encourage you to call 416 535-8501, option 2. You can also find more information at www.camh.ca/en/your-care/access-camh You can also call ConnexOntario for 24/7 mental health information at 1-866-531-2600  Although this discussion forum is not a crisis support service, your safety is important to us. If you are in crisis, feeling suicidal, or need emotional support, please call the Distress Centre at 1-833-456-4566 or text 45645. If this is an emergency it is important to get help right away by calling 9-1-1 or visiting your nearest emergency room.  I hope this helps, please do not hesitate to keep posting and sharing your experiences with us.     "
        }
      ],
      [
        {
          "reply_content": "I am like this all of the time. I have gone to my local ER many times, only to be sent home. I am alone. Lost my family many, many years ago, and lost my second family through a divorce that is still ongoing. How do you feel any hope, when even the professionals are telling you that they aren't qualified to help you? I have C-PTSD, Major Depression, Agoraphobia etc. I would like to try CAMH as I know that I need an inpatient program, but would need someone to drive me there and not sure that I want to drive there, only to have them turn me away. I have huge issues using the phone, so that doesn't help. Tired of being turned down.",
          "sub_reply_content": "In reply to Nothing Special Re: Feeling down by COVID19 Moderator - Saturday, 9 May 2020, 11:40 AM Hi there, thank you for sharing your experiences with us today, you showed a lot of strength and courage by doing that. It can be discouraging not being able to get the help you need, but it seems like taking care of your mental health is important to you. There are many programs that may be able to offer you support either in person or over the phone/computer. If you are interested in accessing CAMH services, I encourage you to call 416 535-8501, option 2. You can also find more information at www.camh.ca/en/your-care/access-camh You can also call ConnexOntario for 24/7 mental health information at 1-866-531-2600  Although this discussion forum is not a crisis support service, your safety is important to us. If you are in crisis, feeling suicidal, or need emotional support, please call the Distress Centre at 1-833-456-4566 or text 45645. If this is an emergency it is important to get help right away by calling 9-1-1 or visiting your nearest emergency room.  I hope this helps, please do not hesitate to keep posting and sharing your experiences with us.     "
        }
      ],
      [
        {
          "reply_content": "Hi there, thank you for sharing your experiences with us today, you showed a lot of strength and courage by doing that. It can be discouraging not being able to get the help you need, but it seems like taking care of your mental health is important to you. There are many programs that may be able to offer you support either in person or over the phone/computer. If you are interested in accessing CAMH services, I encourage you to call 416 535-8501, option 2. You can also find more information at www.camh.ca/en/your-care/access-camh You can also call ConnexOntario for 24/7 mental health information at 1-866-531-2600  Although this discussion forum is not a crisis support service, your safety is important to us. If you are in crisis, feeling suicidal, or need emotional support, please call the Distress Centre at 1-833-456-4566 or text 45645. If this is an emergency it is important to get help right away by calling 9-1-1 or visiting your nearest emergency room.  I hope this helps, please do not hesitate to keep posting and sharing your experiences with us. ",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "Sorry that you are feeling down ,a lot of people are feeling that so you are not alone .Getting up and moving around or going outside even sitting on the porch if you have difficulty walking or just walk around the house and smell the air and the roses or take up hobbies or read or call a friend or FaceTime them , I hope this helps you , if you need a friend Im here for you , maybe we can try to connect online",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "Hi Cr R, I can so relate to your post. I am like this every day. No one can beat me up like I can and there is so much I need to do. Laundry is the main one for me. Getting out for walks would be nice if the weather wasn't SNOW these past few days lol. I do the best I can one day at a time and some days I do sleep. One thing I do that I enjoy is going for a coffee. I drive there (social distancing/mask worn) and go through the drive thru. They have protective measures up. It is my way of getting out for at least one thing pleasurable a couple times a week. I bring a crossword to do also (I enjoy them). I do my best and my best is different each day. I'll get the things I really need to done eventually. I just do. (cutting my nails so I can type will be first on my list now) :) I'm not gonna beat myself up anymore. I am doing the best I can and that is good enough for me today. Blessings to you. I hope you find some small thing you can look forward to each day, one day at a time.",
          "sub_reply_content": "In reply to Butterflyna I am Re: Feeling down by COVID19 Moderator - Tuesday, 12 May 2020, 12:56 PM This is very encouraging to read Butterflyna I am ! It sounds like you have been proactively putting in an effort to remain active and positive during these challenging times. Keep up with the positive spirit and thank you for sharing this with us :)     In reply to Butterflyna I am Re: Feeling down by COVID19 Moderator - Tuesday, 12 May 2020, 2:01 PM Just to add..... having compassion for ourselves during this time is important. It's a challenging time for most of us to setting realistic expectations is ok. So if all you can do on a particular day is go out for a coffee, then that's ok.    "
        }
      ],
      [
        {
          "reply_content": "This is very encouraging to read Butterflyna I am ! It sounds like you have been proactively putting in an effort to remain active and positive during these challenging times. Keep up with the positive spirit and thank you for sharing this with us :)",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "Just to add..... having compassion for ourselves during this time is important. It's a challenging time for most of us to setting realistic expectations is ok. So if all you can do on a particular day is go out for a coffee, then that's ok.",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=94",
    "title": "HELP! Can't get my Antidepressant anymore!!! NARDIL",
    "author": "Butterflyna I am",
    "content": "Hello, I am really having a difficult time. According to my Pharmacist, my antidepressant of 30+ is on back-order and I will run out of it on June 10, 2020. I am really scared. It has been the only medication that has worked for me. It's called NARDIL. Anyone else here having this same issue with this medication???",
    "replies": [
      [
        {
          "reply_content": "Hello Butterflyna I am, Thank you for your post, and for reaching out to the community in this discussion forum for help. I can see that you are scared of running out of your Nardil medication next month. It is true that Canada is currently having concerns about their medication supply because of COVID-19.  In the meantime, it might be helpful for you to seek other resources and support on the side in order to help manage your fear and mood. For example, speaking with your doctor to see if there are any alternatives. Also, you might consider seeking out a therapist to have virtual check-ins who can also guide you on ways to manage your mood, fear, etc. In the meantime, you can also access mental health resources, courses and tools on the Big White Wall.  It would be helpful to know if any other users have experienced this too, and what they did to manage this?",
          "sub_reply_content": "In reply to COVID19 Moderator Re: HELP! Can't get my Antidepressant anymore!!! NARDIL by Mia Oripo - Tuesday, 12 May 2020, 10:15 AM this happened to me a while ago. I went on another medication temporarily and then switched back to my usual medication. It wasn't perfect but it worked out ok and I didn't get worse. I have a good therapist who provides me support. She taught me that medication helps with part of the problem but there are other things I do that also help. I also tell my doctor exactly how I feel and ask her to give me more than one option.     In reply to Mia Oripo Re: HELP! Can't get my Antidepressant anymore!!! NARDIL by Butterflyna I am - Tuesday, 12 May 2020, 12:14 PM Hi Mia, Thanks for your reply. I have had to deal with this happening before and my doc did try me on other meds which only caused more problems. I realize that the medication is only part of the problem. Covid 19 and this is really taking me to a dark place. Unfortunately I only have this one option due to trying all kinds of other meds to no avail. I will stick it out and see if things change. Again, Thank you.     In reply to Butterflyna I am Re: HELP! Can't get my Antidepressant anymore!!! NARDIL by Mia Oripo - Tuesday, 12 May 2020, 2:03 PM Covid is really throwing me into a loop too. I hate it. But I tell myself every day that I'm bigger than this. Just when one challenge is done, another one comes my way. But I'm doing the best I can and will never give up. Hang in there !     In reply to COVID19 Moderator Re: HELP! Can't get my Antidepressant anymore!!! NARDIL by Butterflyna I am - Tuesday, 12 May 2020, 12:09 PM Hi. Yes, I have a good doctor and support from DMHA right in my building. My pharmacist is assisting and I have also a great group of friends for support. I am also a member on the Big White Wall. I was hoping to reach out on here because I live just outside the GTA. Thank you for your reply and I am looking forward to support and helping others on this site.    "
        }
      ],
      [
        {
          "reply_content": "this happened to me a while ago. I went on another medication temporarily and then switched back to my usual medication. It wasn't perfect but it worked out ok and I didn't get worse. I have a good therapist who provides me support. She taught me that medication helps with part of the problem but there are other things I do that also help. I also tell my doctor exactly how I feel and ask her to give me more than one option.",
          "sub_reply_content": "In reply to Mia Oripo Re: HELP! Can't get my Antidepressant anymore!!! NARDIL by Butterflyna I am - Tuesday, 12 May 2020, 12:14 PM Hi Mia, Thanks for your reply. I have had to deal with this happening before and my doc did try me on other meds which only caused more problems. I realize that the medication is only part of the problem. Covid 19 and this is really taking me to a dark place. Unfortunately I only have this one option due to trying all kinds of other meds to no avail. I will stick it out and see if things change. Again, Thank you.     In reply to Butterflyna I am Re: HELP! Can't get my Antidepressant anymore!!! NARDIL by Mia Oripo - Tuesday, 12 May 2020, 2:03 PM Covid is really throwing me into a loop too. I hate it. But I tell myself every day that I'm bigger than this. Just when one challenge is done, another one comes my way. But I'm doing the best I can and will never give up. Hang in there !    "
        }
      ],
      [
        {
          "reply_content": "Hi Mia, Thanks for your reply. I have had to deal with this happening before and my doc did try me on other meds which only caused more problems. I realize that the medication is only part of the problem. Covid 19 and this is really taking me to a dark place. Unfortunately I only have this one option due to trying all kinds of other meds to no avail. I will stick it out and see if things change. Again, Thank you.",
          "sub_reply_content": "In reply to Butterflyna I am Re: HELP! Can't get my Antidepressant anymore!!! NARDIL by Mia Oripo - Tuesday, 12 May 2020, 2:03 PM Covid is really throwing me into a loop too. I hate it. But I tell myself every day that I'm bigger than this. Just when one challenge is done, another one comes my way. But I'm doing the best I can and will never give up. Hang in there !    "
        }
      ],
      [
        {
          "reply_content": "Covid is really throwing me into a loop too. I hate it. But I tell myself every day that I'm bigger than this. Just when one challenge is done, another one comes my way. But I'm doing the best I can and will never give up. Hang in there !",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "Hi. Yes, I have a good doctor and support from DMHA right in my building. My pharmacist is assisting and I have also a great group of friends for support. I am also a member on the Big White Wall. I was hoping to reach out on here because I live just outside the GTA. Thank you for your reply and I am looking forward to support and helping others on this site.",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=96",
    "title": "pandemic help",
    "author": "basketball11 love101",
    "content": "I work in a long term care home and the home just declared on outbreak. I am having really bad anxiety going back into work now after hearing the news. Does anyone have an ideas on what I can do. All I do is hide in my room on my days off and I cry my eyes out thinking about the next time I go into work . I start to panic and my breathing goes all weird and I get sick to my stomach. I can't sleep because it's always on top of my mind. ",
    "replies": [
      [
        {
          "reply_content": "Hello basketball11 love101, thank you for sharing this with us and for choosing to reach out for support on here. I know it is not always easy.  The work you do on the front line is really indispensable and feeling anxious and stressed about this is only normal really. Crying can be therapeutic, and if that's what helps you cope then that is completely okay.  I want to invite you to try this 6-session self help program for anxiety. I would also strongly encourage you to check out the camh.ca/covid19 page for strategies and tips that can help you manage your mental wellbeing amidst all of this.  Sometimes having practical information and guidelines on how to manage and mitigate infection risk can be helpful. If you are interested, you can consult the WHO Advice for Healthcare workers here. Additionally, the government of Canada has issued guidelines for workplaces to follow during the pandemic, including the use of PPE when necessary. You can check out their guidelines here.  I hope this helps! If you notice that your symptoms of anxiety are significantly interfering with your ability to function normally, I encourage you to reach out for formal mental health supports from a recognized agency. The Canadian Psychological Association has provided information where front line workers can access free mental health support here  It would be helpful to know if any other people on here have been in a similar position, and what they did to manage this?",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=97",
    "title": "Addiction and mental health during this pandemic",
    "author": "Zeriah Sawyer-Dodge",
    "content": "I think during this pandemic my cravings have grown to increasingly unbearably painful to manage because Im stuck in my house trapped in my own thoughts. Thinking about past traumas have been all thats flowing through my mind and since getting clean Ive been finding it harder to cope with the fact that im kind of losing my sense reality because I want to find a way out of feeling the way I do. But since losing my counsellor its been difficult reaching out to a someone new because of my abandonment issues and the feeling of being scared that if I talk to someone new that theyll just leave me too. That thought stems from being in the foster system for my whole youth and losing a lot of people in my life whether its through death like my biological parents or losing a friend because theyve grown tired of hearing the same thing from me with having constant problems and now having no one Ive just felt alone. ",
    "replies": [
      [
        {
          "reply_content": "Hi Zeriah, Youve mentioned a few things that seem like they would be best discussed with a therapist/counsellor who can support you in unpacking the thoughts and feeling you are having. I agree, it can be difficult to lose connection with someone who was helping you process this, like you mentioned.   Unfortunately, we cannot provide any counselling on this discussion board. However, I would like to share this webpage with a list of crisis and distress resources around the GTA. If you are from this area, please reach out to the resource closest to you to get some extra, short-term support immediately to help you get through this challenging time. https://www.camh.ca/en/health-info/crisis-resources  If you are feeling comfortable to reach out for extra support, CMHA is also a wonderful resource, and you can check out their website: https://ontario.cmha.ca/local-cmha-branch-supports/ to find a branch near you. They offer support for both addictions and mental health. Alternatively, if you are still finding it hard to reach out to someone new, here is a self-help resource that you are able to review on your own and hopefully, some of the information might be helpful to you. https://valleycentreforcounselling.com/onanxiety  ",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=63",
    "title": "Meditation, Mindfulness and Stress Relieving Techniques",
    "author": "Duchess of Toronto",
    "content": "I am a seasoned expert in the above techniques and I would love to share my education, experience and knowledge. I am both a \"survivor\" of two major mental health crises and a trained health professional in meditation, mindfulness and stress reduction. As well as sharing my knowledge, I am always interested in learning new things!  So let's keep the dialogue in this area alive ;-) Here are a few things you can do RIGHT NOW to help you relax: 1, Backwards counting from 50 with your breath: Start at 50 INHALE; EXHALE at 49; INHALE at 48; EXHALE at 47 and so on. If you forget what number you were at or reach 0 and are still not relaxed - simply restart at 50. I use this to help me drift off into sleep quite often. 2. TAKE 5: INHALE for 5 seconds (say the word 'steamboat' silently in your head for each full second if you don't have a watch) THEN - EXHALE for 5 seconds. Repeat 5xs through. When you get good at this you can try holding the breath for 5 seconds in between - BUT please be seated or laying down for this as holding the breath may cause dizziness.",
    "replies": [
      [
        {
          "reply_content": "Thank you, Duchess!",
          "sub_reply_content": "In reply to Guitar Girl Re: Meditation, Mindfulness and Stress Relieving Techniques by Duchess of Toronto - Tuesday, 7 April 2020, 5:26 PM my pleasure!    "
        }
      ],
      [
        {
          "reply_content": "my pleasure!",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "Thanks! Do you have any good guided meditation videos you can share? I prefer following someone guiding me through meditation.",
          "sub_reply_content": "In reply to ihave aquestion Re: Meditation, Mindfulness and Stress Relieving Techniques by Duchess of Toronto - Wednesday, 8 April 2020, 12:38 PM i recommend https://davidji.com/meditation/  ENJOY and NAMASTE     In reply to ihave aquestion Re: Meditation, Mindfulness and Stress Relieving Techniques by COVID19 Moderator - Saturday, 11 April 2020, 3:04 PM Thanks for sharing these great tips and resources! Here are a few more links to free guided meditation for everyone: 1. Calm App: https://app.www.calm.com/meditate 2. Oprah and Deepak 21 days of meditation: https://chopracentermeditation.com    "
        }
      ],
      [
        {
          "reply_content": "i recommend https://davidji.com/meditation/  ENJOY and NAMASTE",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "Thanks for sharing these great tips and resources! Here are a few more links to free guided meditation for everyone: 1. Calm App: https://app.www.calm.com/meditate 2. Oprah and Deepak 21 days of meditation: https://chopracentermeditation.com",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "Ive heard similar techniques before and done similar techniques and I find them very helpful , thx for you insite",
          "sub_reply_content": "In reply to scott stafford Re: Meditation, Mindfulness and Stress Relieving Techniques by scott stafford - Tuesday, 5 May 2020, 11:11 AM With slow breathing combined with exercise like walking outside and smelling the roses Is my go to also    "
        }
      ],
      [
        {
          "reply_content": "With slow breathing combined with exercise like walking outside and smelling the roses Is my go to also",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "Hi, Duchess. This info is excellent. I'm going to try the counting backwards tonight to sleep.  I want to add that the Center for Mindful Self-Compassion is offering free zoom meditation sessions 4 times a day, every day, to help people cope with Covid-19. Each session is 45 minutes long (including an opening from the leader, meditation, and discussion) and led by an experienced meditation leader from somewhere in the world. Ever since I discovered these, they have been a very helpful part of my day. I have had days when I was very discouraged, and where I felt better after one of these sessions. The center is here: https://centerformsc.org/ And you can sign up for a session here: https://www.signupgenius.com/go/10c0c4aa4af29ab9-free",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=98",
    "title": "Not comforable with my family doctor",
    "author": "sue nich",
    "content": "Hi,   I have a new family doctor for about a year but he doesn't know about my depression and anxiety as I have been coping and managing really well for the last 6 years without medication.  I have been able to do this with with my daily routine, working exercising and my friends and family, but since this all started in March my routine and the way I was able to cope is gone and its been so hard to manage, i have so many bad days, I don't want to do anything and i overeat, the list goes on. I have been thinking about going back on medication, but I don't know where to start or how to ask my doctor as i am not fully comfortable with him. Any advice would be great about asking for help and getting back on medication. thanks",
    "replies": [
      [
        {
          "reply_content": "Hello Sue, Thanks for your post, it takes a lot of courage to reach out and ask for help. Many people are experiencing difficulties right now due to the current covid-19 situation and its ramifications. These are unprecedented times and the struggles you have stated are not uncommon in extremely challenging times. There are options that can give you additional support.  Often times the first step is to get assistance from a family doctor as they have a base knowledge of you, a counsellor or a crisis line. Just a reminder, this platform is not a crisis support service, but we do care about your safety.  Youve mentioned how youre not sure how to disclose your current struggles with anxiety and depression and you wonder how you may go about doing so with your family doctor. I wonder if you would be open to just laying your cards on the table, so to speak, and share what youve posted on this forum. You could give your doctors office a call and ask to make a telephone appointment. Hopefully during that appointment you could share what has been happening since March as well as the interventions that have helped you in the past, like exercise, speaking to friends and family as well as medications.  It can be very difficult to open up to a health care provider and you have been able to face these difficulties in the past, accessing treatment and work very hard to maintain your mental health. Your experience in doing so is vital in establishing a new care plan to address the difficulties you are currently experiencing.  All this being said, if you are in crisis, feeling suicidal, or need more emotional support then stated here, please call the Distress Centre at 1-833-456-4566 or text 45645. If this is an emergency or an urgent matter, its important you get help right away, so please call 911 or go to your closest emergency room.  Non-crisis Additional support:  Managing stress and anxiety: Google: https://play.google.com/store/apps/details?id=com.camh.covid19_managing_stress. Apple: https://apps.apple.com/ca/app/managing-your-stress-anxiety/id1504005917  Psychological Impacts of the Coronavirus (COVID-19) from Canadian Psychological Association: https://cpa.ca/psychology-works-fact-sheet-psychological-impacts-of-the-coronavirus-covid-19/  Online peer-to-peer support community for mental health from Big White Wall: https://www.bigwhitewall.com/?lang=en-ca  Free skill-building program to manage low mood, mild to moderate depression and anxiety, stress or worry, Coaching via phone + online videos, Bounce Back Ontario managed by Canadian Mental Health Association (CMHA): https://bouncebackontario.ca/",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=99",
    "title": "Harm Reduction Kits? Addiction Support?",
    "author": "insom 96",
    "content": "I'm finding it difficult to figure out what kind of services are available and what aren't for people with addiction. I've seen online news reports from Hamilton saying many of their harm reduction services are closed and I'm wondering what's available in Toronto? Is CAMH is still providing harm reduction kits or addiction treatment programs? I can't find stuff on their website about changes in their programs other than the fact that things are moving online more.  Anyone know where I can find this kind of information without having to call every program/org I come across? ",
    "replies": [
      [
        {
          "reply_content": "Hello insom 96, thank you for reaching out here. I can see how it can get frustrating having to reach out to every organization separately to inquire about services. Access to addiction services is really vital and disruption to such services can be critical.  I understand why it can be hard to find a COVID19 updated list of which services are open and which are not due to the fact that organizations are continuing to change their procedures according to the continuously evolving situation. However, you can find here a compiled list of harm reduction services in Toronto and where you can go if you're looking for help. For access to or questions about CAMH services, the process is straightforward. I encourage you to call 416 535-8501, option 2. You can also find more information at www.camh.ca/en/your-care/access-camh",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=100",
    "title": "Is anyone perfect when it comes to physical distancing?",
    "author": "Guitar Girl",
    "content": "Hello, While I know that we all need to practice physical distancing at all times, I'm having trouble doing it perfectly.  I live on a street which is tiny and cramped and has kids on it.  When I walk out my door, there are my neighbours 10 feet away on their own property.  I love all my neighbours.  I have a kid too and our kids play together--not all day but sometimes on weekends.  They ride bikes, play hockey or soccer on the street and are trying to stay 6 feet away from each other but it's not perfect.  The only way to do this perfectly would be to yank my kid inside the house each time someone else comes out.   I have taken my kid to the park etc. but there are always more kids at the park than on my street. Plus, kids at the park are all strangers, not like the bubble of 4 families of neighbours who all know each other.  They say it takes a village to raise a child and my little street is a village.  I find that taking my kid to the park comes with more risks than letting them play on the street where everyone is known to them. So, I'm not a perfect physical distancer but am doing my best.  But if there are other insights or advice that people have, I would like to hear it.  Thanks.",
    "replies": [
      [
        {
          "reply_content": "Hello Guitar Girl, thank you for haring your experiences and concern with us here. It definitely sounds like you are doing your best to respect the recommended guidelines and you should give yourself credit for that. Undoubtedly, it is hard to follow guidelines like social distancing perfectly, for the simple reason that we can only control our behaviour and not others'. I also appreciate how you were able to find a middle ground between staying at home and going to overcrowded parks by opting to let the kids play in the street. That resonates with me too as a safe option.  Children are born learners and can be quite innovative. When going to the park or playing in the street with other kids, they can engage is social-distanced games like soccer, rope hopping, charades, scavenger hunt, hide & seek and many others! You can even make an activity out of this where you brainstorm with the children social distanced games for them to play. Most of us may not be perfect \"social distancers\", but I think we can still reduce risk by adopting the suggested recommendations like wearing masks and going to less crowded area -as you are doing already- . You can check out this website for more ideas on how to help yourself and your children during these times  I would be interest myself in hearing other people's strategies on how they are going about this?",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=91",
    "title": "I have mixed feelings about things opening up , i like to go back to normal but worried that I will get the virus and that the employer will provide the safety for employees",
    "author": "scott stafford",
    "content": "What does everyone think",
    "replies": [
      [
        {
          "reply_content": "Hi Scott, Thanks for your post. I think your worries are commonly shared by many of us trying to navigate back to (somewhat) normal. As a society we've had to rethink how our work will continue to get done while also doing our best to keep everyone safe. While some business may be opening up, we can still follow the precautions (wearing a mask, frequent hand washing etc.) It may be helpful to approach your employer in advance to explore what your return to work might look like - what precautions will be put into place such as reorganizing physical spaces, doing more tasks remotely and will they provide protective equipment if needed. If possible, you may consider also speaking to some of your co-workers to see what they think. Depending on your workplace, an Employee Assistance Program or Human Resources department may also be able to provide some support and guidance. curious to hear what other folks have implemented with planning a return to work",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "Hi Scott!  Nice to e-meet you and hope you are keeping well. I turned to this discussion board for the same reason that you did; hoping to get some support and perspective during an interesting time. Currently, I am working from home and live with a parent who would be considered part of the vulnerable population. I too have worries about risking my health and the health of my parent when I return back to work. Since working from home, productivity has been great within my company, so much that HR is now considering implementing a flexible work from home policy when things do go back to normal. This might be something to bring up to your HR department if you haven't yet already. I truly believe that any decision your employer will make will take into account your health and well being as top priority. Hope this helps you - stay positive! :)",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "Hi Scott, I'm new to this site and I realize it's been a while since you posted this but I just wanted to say I hope your fears were alleviated and that things are going well for you wether or not you have gone back to work. I was really concerned when a member of my family wanted to go work a job in the public sector but she is being careful and all is well so far so I hope it's the same for you.",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=103",
    "title": "Making an effort to reach out",
    "author": "DAVANA L",
    "content": "I am usually a pretty private person so its not an easy thing for me to put myself out there. But I've been really struggling lately and have to admit that I am in need of sharing and support. Any response would be greatly appreciated.",
    "replies": [
      [
        {
          "reply_content": "Hi Davana, Thank you for your post, you showed a lot of courage by sharing with us today. It is not uncommon for people to feel like they are struggling during this time. This forum is a great place to reach out for support and share with the community. It can also be helpful to reach out to loved ones for support, and if you feel like you are still struggling its usually a good idea to get assistance from a family doctor, a counsellor or a crisis line. For more information and resources, I encourage you to visit our website at www.camh.ca/covid19",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "Hi Davana, I am much the same way, but when you start to reach out you find you are not alone. So many people are struggling right now. I hope you are feeling a bit better as I see your post is from a few weeks ago, I just joined this forum today.",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=93",
    "title": "Friend problem",
    "author": "Catness 45",
    "content": "I have a friend who I recently reconnected with after a few years. Now she is into all of the COVID conspiracy theories and is very anti-government. She went to the COVID protest at Queen's Park, even though it was a 4 hour drive. I'm finding her ideas to not be helpful to my mental health. I don't know how to, in a healthy way, create some space between us, at least until this is over. Any suggestions? She wants to Skype and sends me articles. It's not like there's much else to talk about right now if we were to Skype; I don't think I could not talk about COVID. This friendship is creating quite a bit of stress for me. We used to be best friends so I don't want to exclude her from my life permanently. ",
    "replies": [
      [
        {
          "reply_content": "Hi Catness 45, thanks so much for sharing your experiences with us today. It sounds like taking care of your mental health, while also maintaining your friendship, is important to you.  It can be stressful when our friends and family share opinions that conflict with our own views. It may be helpful to have an open conversation with your friend about the way you are feeling and perhaps agree to discuss other topics and mutual interests during your Skype calls instead. Practicing self-care is also important. If your friend continues sharing conspiracy theories, it may be helpful to explain that while you respect her differing opinions, you would like to have some space during this time as these conversations are causing some stress for you.  For more resources and tips on managing stress during the pandemic, I encourage you to visit our website www.camh.ca/covid19  Stay safe!",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "It's a matter of setting boundaries with her. I find it really hard maintaining friendships with some people right now as I feel their true colours come out in times like this and unfortunately I have been so disappointed with some people. And for me once I lose respect for someone then that's it....I can't help it I just get turned off by certain behaviours esp. selfishness .",
          "sub_reply_content": "In reply to Jenny D. Re: Friend problem by COVID19 Moderator - Thursday, 30 July 2020, 5:07 PM Hi Jenny D, thank you for your response and suggestion. Setting boundaries is definitely important, while having an open and honest conversation where you can express how you are feeling in a respectful way.    "
        }
      ],
      [
        {
          "reply_content": "Hi Jenny D, thank you for your response and suggestion. Setting boundaries is definitely important, while having an open and honest conversation where you can express how you are feeling in a respectful way.",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=105",
    "title": "Any good safe economical facemark referral please?",
    "author": "worried parent",
    "content": "Hello, I am new here. I have an Autistic 21 year old son who likes to go the Malls and Parks and I am seeking a good mask for him.  My research is showing that N95 masks are the safest but they are not reusable or washable. The 2nd best are Surgical masks but these are disposable. So both options would be expensive. Can anyone recommend a reusable/washable mask which would suffice or would it be best to go with one of the above mentioned please? Thank you.",
    "replies": [
      [
        {
          "reply_content": "Hi there, thank you for sharing with us today. It can be worrisome thinking about the health and safety of your children during the pandemic, but it sounds like you have done some great research on effective face mask options for your son.    While N95 masks offer more protection than surgical masks, they are intended for healthcare providers and not recommended for the general public. Instead, the Centres for Disease Control and Prevention recommends the use of reusable cloth face masks. Here are some tips on finding the best cloth face mask: Find a mask with two or more layers of washable material (such as cotton or linen) A mask that completely covers your face and mouth Fits snug against the sides of your face  For more information on finding and wearing cloth masks, visit the following websites: 1.  CDC: https://www.cdc.gov/coronavirus/2019-ncov/prevent-getting-sick/about-face-coverings.html  2. Government of Canada: https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/prevention-risks/about-non-medical-masks-face-coverings.html#_Appropriate_non-medical_mask CBC Canada also published a list of non-medical face masks you can order that have at least two layers of tightly woven fabric, and contain ties/ear loops, as per the Public Health Agency of Canada guidelines: https://www.cbc.ca/life/wellness/non-medical-face-masks-you-can-order-in-canada-1.5572511",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=106",
    "title": "Just Reaching Out",
    "author": "John Doe",
    "content": "Hello,      I was diagnosed with Borderline Personality Disorder three years ago. I have taken part in the Dialectic Behavioral Therapy offered at my local CMHA about a year and a half ago. Besides struggling with BDP, I tend to struggle with Social Anxiety as well as Depression. To say the least, the pandemic has been a little overwhelming at times. Couple that with getting a new job in May of this year and I have been very anxious most days. One of the more ironic things about my employment is that I am working at my local CMHA so unfortunately, due to conflict of interest concerns I am not able to be treated there. I was referred to a different agency close to where I live, but I was not able to keep my appointments and my counselling just kinda fell off after a while. Around the same time I was also seeing a behavioral change counsellor about my substance abuse issues, but that also kinda just fell off at the start of the pandemic due to the counsellor I was seeing taking time off for personal safety reasons and neither one of us really following-up on things. Somewhat needless to say, things have been rough at times, I know I'm not the only one going through stuff, all of humanity is basically dealing with the issues related to the pandemic, so I don't want to come off as I think I am the only one or anything like that, but with my condition and circumstances, things can be pretty difficult for me.  Due to the previously mentioned things as well as the fact that I live alone and can feel quite lonely at times, I wanted to make this post. Just to reach out and tell my story, or at least a part of it, as well as let anyone out there with similar things that your not alone. I know how empty those words can seem when your going through things, but from someone who knows that type of pain and hurt, I just want to say your not alone. I promise.",
    "replies": [
      [
        {
          "reply_content": "Hi John Doe, thank you for sharing your story with us here today! It must be difficult to deal with many co-occurring conditions, especially during this pandemic. I am sorry to hear that you lost connection with your counsellors as well. Even though everyone is going through their own difficulties during this time, we definitely do not want to discount the difficulties you have been/are facing. It is also very important that you take care of yourself during this time as well. It can be helpful to reach out to loved ones for support, and/or your family doctor or other health professionals (some counsellors are now offering virtual visits) for additional support, if required. We would like to thank you once again for sharing your personal story and for your empathetic words!  You can also check out our website for additional tips to help you during this time: http://www.camh.ca/covid19",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=104",
    "title": "anxiety/saddness",
    "author": "Jenny D.",
    "content": "Hi! I have had a few episodes of depression which at the moment is controlled. However, I had a rough day at work yesterday and feel the beginnings of saddness which can lead to depression if I'm not careful. I can usually handle the odd bad day as we all get them and it's part of being human but I'm wondering if because of all the other things going on, the pandemic, lack of fun time, haven't seen friends lately, if it's pushed me over the edge a bit....I feel so so tired and just want to be by myself....but maybe that's because I've been working more lately and am around people quite intensely with my job...I\"m not sure if it's the depression or just normal needing down time.  I also had my first covid test yesterday on my way out of work, It was quick and not too bad but a few minutes after on my way to my car I was seconds from passing out! I've feel a bit off since...and I didn't make it into work today...I am self employed luckily so I can switch days if I really have to...I feel pretty embarassed about that, thank god I made it to my car so no one saw me!! One of my major tools to help deal with depression has not  been available to me since March, it's a support group and it's the one thing that I really do miss:(",
    "replies": [
      [
        {
          "reply_content": "Hi Jenny D, thank you for all of your posts today!  I am sorry to hear that you had a rough day yesterday. Getting a COVID test can be tough as is, and not feeling well afterwards can be hard. You are absolutely correct: we are all human and many of us experience the odd off day. It is great that you took a day off of work, as self-care is really important.  The pandemic has changed a lot of our routines and many of us are not seeing our family/friends as much as we used to, which can have an impact on our mood. While being sad is a normal reaction to such events, constantly feeling this way can be difficult and it can have a negative impact. Its good to check in with your doctor, mental health professional, and your family/friends to make sure that you are getting the support that you need and deserve, especially since the support groups arent currently available to you. You can also check out additional tips here. Hope this helps!",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "Hi jenny I just signed up for this peer discussion and am reaching out as part of a health promotion project for school I see that your posting was way back in july so perhaps this will not be sent to you I am trying to see if there is a way to develop connections with people experiencing similar struggles to be a supportive network If this letter reaches you I can be reached at 200470214@student.georgianc.on.ca I am also female and seeking connection to meet my goal to strive for happiness",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=107",
    "title": "Sleeping",
    "author": "northern dancer",
    "content": "Im sleeping a lot! Cant wait till bedtime, hate to get up in the morning.  I feel like I have a internal scream inside me,I just dont feel safe to let it out!  Thank god for my dog, hes the only thing keeping me going.  I think I need some counseling but Im afraid to reach out to one.  I feel like most of them are even more off their rocker then I am.",
    "replies": [
      [
        {
          "reply_content": "Hi Northern Dancer,  Thank you for sharing your thoughts and feelings with us today, you showed a lot of strength by doing that. I am sorry to hear that you are having trouble getting up in the morning, but I am happy to hear that your dog has been an important support for you. Please know that it is normal to feel afraid to reach out to someone for counselling, however getting additional support when needed is really important. You have made a great first step in recognizing your needs and joining this discussion forum.   Finding the right counsellor for your needs may take some time, but we encourage you to reach out for support. It can also be helpful to involve a friend or family member. Here are some services below that may be helpful to get started:  Access CAMH: Simply call 416 535 8501, option 2 for information about mental health services Ontario Mental Health Helpline provides information about mental health services in Ontario Call 1-866-531-2600 or visit their website: http://www.mentalhealthhelpline.ca/  Distress and Crisis Ontario offers support and a variety of services to people looking for someone to talk to when feeling lonely or down, or having suicidal thoughts. Find your closest Distress Centre at: http://www.dcontario.org/centres.html#Ontario Stay safe and we are wishing you all the best. Thanks again for reaching out to us!",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=108",
    "title": "Is this \"Breathe Easy\" Mask Enhancer safe?",
    "author": "worried parent",
    "content": "Hello, I saw this new apparatus and wondering if it will be safe to use it please? https://getcoolturtle.com",
    "replies": [
      [
        {
          "reply_content": "Hi there, thank you for your post! We are happy to know that you are taking your safety into consideration before purchasing any products. Though we cannot comment on the safety for any commercial mask/accessories, we can inform you that the World Health Organization (WHO) stated the following below:   There are different mask shapes such as flat-fold or duckbill  find the one that fits closely over your nose, cheeks and chin. When the edges of the mask are not close to the face and shift, such as when speaking, air penetrates through the edges of the mask rather than being filtered through the fabric. Masks with vents or exhalation valves are not advised because they allow unfiltered breath to escape the mask.  For more information on mask recommendations, please visit the page called Coronavirus disease (COVID-19): Masks on the WHO website.",
          "sub_reply_content": "In reply to COVID19 Moderator Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Monday, 21 December 2020, 12:23 PM Thank you for the response but that further complicates things I think because the more snug the mask is the more difficult to breathe but I do understand the benefit of having the mask fit snugly. Based on that info then I would have to think that best scenario might be to get this accessory and have the filter in front of it maybe?     In reply to worried parent Re: Is this \"Breathe Easy\" Mask Enhancer safe? by COVID19 Moderator - Monday, 21 December 2020, 4:44 PM Hi there, while wearing a mask that fits closely over your nose, cheeks and chin helps to avoid air from coming through the edges of the mask, some people may feel that it is harder to breathe. This trade-off can make it difficult for some people, making it harder for them to keep their masks on for extended periods of time.   Again, though we cannot comment on the safety for any commercial mask/accessories worn either underneath or in front of the mask, I do want to kindly note the following disclaimer that is mentioned on the website: The Cool Turtle product is intended for use with non-medical masks only. Do not use for any medical purposes. For guidance on the proper use of non-medical masks, please feel free to review the Non-Medical Masks and Face Covering page on the Government of Canada website.   My apologies that we cannot give you a direct answer to your question. We hope these resources can help you make an informed decision regarding your safety.      In reply to COVID19 Moderator Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Tuesday, 22 December 2020, 10:01 AM I understand and thank you. If I may touch on one final aspect of this please, the article you referenced states:  \"Masks with vents or exhalation valves are not advised because they allow unfiltered breath to escape the mask.\"  My info on what exactly spreads the virus are \"droplets\" [so liquids] when one is speaking or sneezing. if that is accurate then I am not understanding about \"breath\" escaping issues, can you shed some light on this for me please? Seems to me if breath escaping can transfer the virus then face shields would not be of much use?     In reply to worried parent Re: Is this \"Breathe Easy\" Mask Enhancer safe? by COVID19 Moderator - Tuesday, 22 December 2020, 11:15 AM Hi there, first and foremost, thank you for taking the time to do your research in order to protect yourself and/or your loved ones, and for bringing your questions here for others to learn from as well. We not only welcome you to touch on aspects of the article(s), but we encourage you to do so!  With regards to droplets: Naturally produced droplets from humans not only include droplets produced by sneezing and coughing, but they also include droplets produced by breathing as well! Not everyone is aware of this, so I am happy that you asked this question.   With regards to vents/exhalation valves: It is said that, \"Masks with exhalation valves or vents are not recommended. These masks do not protect others from COVID-19 or limit the spread of the virus. This is because they allow infectious respiratory droplets to spread outside the mask.\"  With regards to face shields: It is said that, \"A face shield is used to protect the eyes of the person wearing it. Using a face shield without a mask: won't protect you from potentially inhaling infectious respiratory droplets exhaled by others, and it won't protect others from your infectious respiratory droplets, as they can escape around the face shield\".  Again, we encourage you to continue asking more questions that you may have. Thanks again for bringing your questions to us and we hope to hear back from you!      In reply to COVID19 Moderator Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Tuesday, 5 January 2021, 3:57 PM So guys, hoping you all had a great and safe Holiday [mine was very quiet]. After putting a lot of thought into this and wanting to be as safe as possible I have these questions.  Since the virus would be in the air from an infected person in an enclosed room or car then being 6' apart should not make much difference?  Also, I don't think I have ever seen anyone with a mask which would be tight fitting enough to prevent air from being exchanged so maybe the Gaiter might be the best mask since it should keep the air between your mouth and all the way down the neck?     In reply to worried parent Re: Is this \"Breathe Easy\" Mask Enhancer safe? by COVID19 Moderator - Tuesday, 5 January 2021, 4:52 PM Hi, happy holidays to you as well! Thank you for bringing your thought-provoking questions to us here today.  Wearing proper personal protective equipment (e.g., a mask, gown, face shield etc.) and maintaining physical distance (i.e., at least 6 feet) helps to reduce your risk of getting COVID. As mentioned on the Government of Canada website, risk is higher when youre in smaller, crowded or enclosed spaces, where you may be unable to maintain a physical distance from others and practise good hygiene, such as washing your hands. If you are caring for someone with COVID, it is still recommended to maintain at least 6 feet distance. Please see this page for more details here.  You are correct, according to Public Health Ontario masks (including non-medical masks) should be tightly fitting in order to effectively contain the respiratory droplets of the wearer. When considering what type of non-medical mask to use, the fitting and the material of the mask are both important to consider. It says that, \"materials with higher filtration efficiency may offer additional protection\".   We hope this helps provide you with additional information to help keep you and your loved ones safe.      In reply to COVID19 Moderator Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Wednesday, 6 January 2021, 10:03 AM Since the virus would be in the air in an enclosed room or car, would it make sense to get an air sanitizer \" spray\" before people enter the room and afterwards? If yes, any recommendations for Sprays please?     In reply to worried parent Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Wednesday, 6 January 2021, 10:06 AM Sorry I can't edit previous reply. To clarify I meant sprays for the air and not surfaces.     In reply to worried parent Re: Is this \"Breathe Easy\" Mask Enhancer safe? by COVID19 Moderator - Wednesday, 6 January 2021, 2:04 PM Hi worried parent. Thank you for your response. These are very important questions and concerns that many people are currently facing. Thank you for bringing this to the attention of our discussion forum. That being said, we are not public health experts and therefore we are unable to provide government-approved sanitation recommendations or answers related to public health concerns. However, we would like to provide you with this link here, where you can ask public health experts your questions. If you have any mental health symptoms, such as anxiety, related to COVID-19, please do not hesitate to reach out to us here. Thank you!     In reply to COVID19 Moderator Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Thursday, 7 January 2021, 10:48 AM I agree that my questions should be more accurately answered at the CDC ad there is conflicting info.  For example it was mentioned here that the mask should have a \"snug\" fit all round the noise and mouth but in this article here:  \"https://www.hopkinsmedicine.org/health/conditions-and-diseases/coronavirus/coronavirus-face-masks-what-you-need-to-know\"  Your mask should cover your face from the bridge of your nose to under your chin. \"It should be loose fitting\" but secure enough to stay in place.    "
        }
      ],
      [
        {
          "reply_content": "Thank you for the response but that further complicates things I think because the more snug the mask is the more difficult to breathe but I do understand the benefit of having the mask fit snugly. Based on that info then I would have to think that best scenario might be to get this accessory and have the filter in front of it maybe?",
          "sub_reply_content": "In reply to worried parent Re: Is this \"Breathe Easy\" Mask Enhancer safe? by COVID19 Moderator - Monday, 21 December 2020, 4:44 PM Hi there, while wearing a mask that fits closely over your nose, cheeks and chin helps to avoid air from coming through the edges of the mask, some people may feel that it is harder to breathe. This trade-off can make it difficult for some people, making it harder for them to keep their masks on for extended periods of time.   Again, though we cannot comment on the safety for any commercial mask/accessories worn either underneath or in front of the mask, I do want to kindly note the following disclaimer that is mentioned on the website: The Cool Turtle product is intended for use with non-medical masks only. Do not use for any medical purposes. For guidance on the proper use of non-medical masks, please feel free to review the Non-Medical Masks and Face Covering page on the Government of Canada website.   My apologies that we cannot give you a direct answer to your question. We hope these resources can help you make an informed decision regarding your safety.      In reply to COVID19 Moderator Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Tuesday, 22 December 2020, 10:01 AM I understand and thank you. If I may touch on one final aspect of this please, the article you referenced states:  \"Masks with vents or exhalation valves are not advised because they allow unfiltered breath to escape the mask.\"  My info on what exactly spreads the virus are \"droplets\" [so liquids] when one is speaking or sneezing. if that is accurate then I am not understanding about \"breath\" escaping issues, can you shed some light on this for me please? Seems to me if breath escaping can transfer the virus then face shields would not be of much use?     In reply to worried parent Re: Is this \"Breathe Easy\" Mask Enhancer safe? by COVID19 Moderator - Tuesday, 22 December 2020, 11:15 AM Hi there, first and foremost, thank you for taking the time to do your research in order to protect yourself and/or your loved ones, and for bringing your questions here for others to learn from as well. We not only welcome you to touch on aspects of the article(s), but we encourage you to do so!  With regards to droplets: Naturally produced droplets from humans not only include droplets produced by sneezing and coughing, but they also include droplets produced by breathing as well! Not everyone is aware of this, so I am happy that you asked this question.   With regards to vents/exhalation valves: It is said that, \"Masks with exhalation valves or vents are not recommended. These masks do not protect others from COVID-19 or limit the spread of the virus. This is because they allow infectious respiratory droplets to spread outside the mask.\"  With regards to face shields: It is said that, \"A face shield is used to protect the eyes of the person wearing it. Using a face shield without a mask: won't protect you from potentially inhaling infectious respiratory droplets exhaled by others, and it won't protect others from your infectious respiratory droplets, as they can escape around the face shield\".  Again, we encourage you to continue asking more questions that you may have. Thanks again for bringing your questions to us and we hope to hear back from you!      In reply to COVID19 Moderator Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Tuesday, 5 January 2021, 3:57 PM So guys, hoping you all had a great and safe Holiday [mine was very quiet]. After putting a lot of thought into this and wanting to be as safe as possible I have these questions.  Since the virus would be in the air from an infected person in an enclosed room or car then being 6' apart should not make much difference?  Also, I don't think I have ever seen anyone with a mask which would be tight fitting enough to prevent air from being exchanged so maybe the Gaiter might be the best mask since it should keep the air between your mouth and all the way down the neck?     In reply to worried parent Re: Is this \"Breathe Easy\" Mask Enhancer safe? by COVID19 Moderator - Tuesday, 5 January 2021, 4:52 PM Hi, happy holidays to you as well! Thank you for bringing your thought-provoking questions to us here today.  Wearing proper personal protective equipment (e.g., a mask, gown, face shield etc.) and maintaining physical distance (i.e., at least 6 feet) helps to reduce your risk of getting COVID. As mentioned on the Government of Canada website, risk is higher when youre in smaller, crowded or enclosed spaces, where you may be unable to maintain a physical distance from others and practise good hygiene, such as washing your hands. If you are caring for someone with COVID, it is still recommended to maintain at least 6 feet distance. Please see this page for more details here.  You are correct, according to Public Health Ontario masks (including non-medical masks) should be tightly fitting in order to effectively contain the respiratory droplets of the wearer. When considering what type of non-medical mask to use, the fitting and the material of the mask are both important to consider. It says that, \"materials with higher filtration efficiency may offer additional protection\".   We hope this helps provide you with additional information to help keep you and your loved ones safe.      In reply to COVID19 Moderator Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Wednesday, 6 January 2021, 10:03 AM Since the virus would be in the air in an enclosed room or car, would it make sense to get an air sanitizer \" spray\" before people enter the room and afterwards? If yes, any recommendations for Sprays please?     In reply to worried parent Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Wednesday, 6 January 2021, 10:06 AM Sorry I can't edit previous reply. To clarify I meant sprays for the air and not surfaces.     In reply to worried parent Re: Is this \"Breathe Easy\" Mask Enhancer safe? by COVID19 Moderator - Wednesday, 6 January 2021, 2:04 PM Hi worried parent. Thank you for your response. These are very important questions and concerns that many people are currently facing. Thank you for bringing this to the attention of our discussion forum. That being said, we are not public health experts and therefore we are unable to provide government-approved sanitation recommendations or answers related to public health concerns. However, we would like to provide you with this link here, where you can ask public health experts your questions. If you have any mental health symptoms, such as anxiety, related to COVID-19, please do not hesitate to reach out to us here. Thank you!     In reply to COVID19 Moderator Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Thursday, 7 January 2021, 10:48 AM I agree that my questions should be more accurately answered at the CDC ad there is conflicting info.  For example it was mentioned here that the mask should have a \"snug\" fit all round the noise and mouth but in this article here:  \"https://www.hopkinsmedicine.org/health/conditions-and-diseases/coronavirus/coronavirus-face-masks-what-you-need-to-know\"  Your mask should cover your face from the bridge of your nose to under your chin. \"It should be loose fitting\" but secure enough to stay in place.    "
        }
      ],
      [
        {
          "reply_content": "Hi there, while wearing a mask that fits closely over your nose, cheeks and chin helps to avoid air from coming through the edges of the mask, some people may feel that it is harder to breathe. This trade-off can make it difficult for some people, making it harder for them to keep their masks on for extended periods of time.   Again, though we cannot comment on the safety for any commercial mask/accessories worn either underneath or in front of the mask, I do want to kindly note the following disclaimer that is mentioned on the website: The Cool Turtle product is intended for use with non-medical masks only. Do not use for any medical purposes. For guidance on the proper use of non-medical masks, please feel free to review the Non-Medical Masks and Face Covering page on the Government of Canada website.   My apologies that we cannot give you a direct answer to your question. We hope these resources can help you make an informed decision regarding your safety. ",
          "sub_reply_content": "In reply to COVID19 Moderator Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Tuesday, 22 December 2020, 10:01 AM I understand and thank you. If I may touch on one final aspect of this please, the article you referenced states:  \"Masks with vents or exhalation valves are not advised because they allow unfiltered breath to escape the mask.\"  My info on what exactly spreads the virus are \"droplets\" [so liquids] when one is speaking or sneezing. if that is accurate then I am not understanding about \"breath\" escaping issues, can you shed some light on this for me please? Seems to me if breath escaping can transfer the virus then face shields would not be of much use?     In reply to worried parent Re: Is this \"Breathe Easy\" Mask Enhancer safe? by COVID19 Moderator - Tuesday, 22 December 2020, 11:15 AM Hi there, first and foremost, thank you for taking the time to do your research in order to protect yourself and/or your loved ones, and for bringing your questions here for others to learn from as well. We not only welcome you to touch on aspects of the article(s), but we encourage you to do so!  With regards to droplets: Naturally produced droplets from humans not only include droplets produced by sneezing and coughing, but they also include droplets produced by breathing as well! Not everyone is aware of this, so I am happy that you asked this question.   With regards to vents/exhalation valves: It is said that, \"Masks with exhalation valves or vents are not recommended. These masks do not protect others from COVID-19 or limit the spread of the virus. This is because they allow infectious respiratory droplets to spread outside the mask.\"  With regards to face shields: It is said that, \"A face shield is used to protect the eyes of the person wearing it. Using a face shield without a mask: won't protect you from potentially inhaling infectious respiratory droplets exhaled by others, and it won't protect others from your infectious respiratory droplets, as they can escape around the face shield\".  Again, we encourage you to continue asking more questions that you may have. Thanks again for bringing your questions to us and we hope to hear back from you!      In reply to COVID19 Moderator Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Tuesday, 5 January 2021, 3:57 PM So guys, hoping you all had a great and safe Holiday [mine was very quiet]. After putting a lot of thought into this and wanting to be as safe as possible I have these questions.  Since the virus would be in the air from an infected person in an enclosed room or car then being 6' apart should not make much difference?  Also, I don't think I have ever seen anyone with a mask which would be tight fitting enough to prevent air from being exchanged so maybe the Gaiter might be the best mask since it should keep the air between your mouth and all the way down the neck?     In reply to worried parent Re: Is this \"Breathe Easy\" Mask Enhancer safe? by COVID19 Moderator - Tuesday, 5 January 2021, 4:52 PM Hi, happy holidays to you as well! Thank you for bringing your thought-provoking questions to us here today.  Wearing proper personal protective equipment (e.g., a mask, gown, face shield etc.) and maintaining physical distance (i.e., at least 6 feet) helps to reduce your risk of getting COVID. As mentioned on the Government of Canada website, risk is higher when youre in smaller, crowded or enclosed spaces, where you may be unable to maintain a physical distance from others and practise good hygiene, such as washing your hands. If you are caring for someone with COVID, it is still recommended to maintain at least 6 feet distance. Please see this page for more details here.  You are correct, according to Public Health Ontario masks (including non-medical masks) should be tightly fitting in order to effectively contain the respiratory droplets of the wearer. When considering what type of non-medical mask to use, the fitting and the material of the mask are both important to consider. It says that, \"materials with higher filtration efficiency may offer additional protection\".   We hope this helps provide you with additional information to help keep you and your loved ones safe.      In reply to COVID19 Moderator Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Wednesday, 6 January 2021, 10:03 AM Since the virus would be in the air in an enclosed room or car, would it make sense to get an air sanitizer \" spray\" before people enter the room and afterwards? If yes, any recommendations for Sprays please?     In reply to worried parent Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Wednesday, 6 January 2021, 10:06 AM Sorry I can't edit previous reply. To clarify I meant sprays for the air and not surfaces.     In reply to worried parent Re: Is this \"Breathe Easy\" Mask Enhancer safe? by COVID19 Moderator - Wednesday, 6 January 2021, 2:04 PM Hi worried parent. Thank you for your response. These are very important questions and concerns that many people are currently facing. Thank you for bringing this to the attention of our discussion forum. That being said, we are not public health experts and therefore we are unable to provide government-approved sanitation recommendations or answers related to public health concerns. However, we would like to provide you with this link here, where you can ask public health experts your questions. If you have any mental health symptoms, such as anxiety, related to COVID-19, please do not hesitate to reach out to us here. Thank you!     In reply to COVID19 Moderator Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Thursday, 7 January 2021, 10:48 AM I agree that my questions should be more accurately answered at the CDC ad there is conflicting info.  For example it was mentioned here that the mask should have a \"snug\" fit all round the noise and mouth but in this article here:  \"https://www.hopkinsmedicine.org/health/conditions-and-diseases/coronavirus/coronavirus-face-masks-what-you-need-to-know\"  Your mask should cover your face from the bridge of your nose to under your chin. \"It should be loose fitting\" but secure enough to stay in place.    "
        }
      ],
      [
        {
          "reply_content": "I understand and thank you. If I may touch on one final aspect of this please, the article you referenced states:  \"Masks with vents or exhalation valves are not advised because they allow unfiltered breath to escape the mask.\"  My info on what exactly spreads the virus are \"droplets\" [so liquids] when one is speaking or sneezing. if that is accurate then I am not understanding about \"breath\" escaping issues, can you shed some light on this for me please? Seems to me if breath escaping can transfer the virus then face shields would not be of much use?",
          "sub_reply_content": "In reply to worried parent Re: Is this \"Breathe Easy\" Mask Enhancer safe? by COVID19 Moderator - Tuesday, 22 December 2020, 11:15 AM Hi there, first and foremost, thank you for taking the time to do your research in order to protect yourself and/or your loved ones, and for bringing your questions here for others to learn from as well. We not only welcome you to touch on aspects of the article(s), but we encourage you to do so!  With regards to droplets: Naturally produced droplets from humans not only include droplets produced by sneezing and coughing, but they also include droplets produced by breathing as well! Not everyone is aware of this, so I am happy that you asked this question.   With regards to vents/exhalation valves: It is said that, \"Masks with exhalation valves or vents are not recommended. These masks do not protect others from COVID-19 or limit the spread of the virus. This is because they allow infectious respiratory droplets to spread outside the mask.\"  With regards to face shields: It is said that, \"A face shield is used to protect the eyes of the person wearing it. Using a face shield without a mask: won't protect you from potentially inhaling infectious respiratory droplets exhaled by others, and it won't protect others from your infectious respiratory droplets, as they can escape around the face shield\".  Again, we encourage you to continue asking more questions that you may have. Thanks again for bringing your questions to us and we hope to hear back from you!      In reply to COVID19 Moderator Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Tuesday, 5 January 2021, 3:57 PM So guys, hoping you all had a great and safe Holiday [mine was very quiet]. After putting a lot of thought into this and wanting to be as safe as possible I have these questions.  Since the virus would be in the air from an infected person in an enclosed room or car then being 6' apart should not make much difference?  Also, I don't think I have ever seen anyone with a mask which would be tight fitting enough to prevent air from being exchanged so maybe the Gaiter might be the best mask since it should keep the air between your mouth and all the way down the neck?     In reply to worried parent Re: Is this \"Breathe Easy\" Mask Enhancer safe? by COVID19 Moderator - Tuesday, 5 January 2021, 4:52 PM Hi, happy holidays to you as well! Thank you for bringing your thought-provoking questions to us here today.  Wearing proper personal protective equipment (e.g., a mask, gown, face shield etc.) and maintaining physical distance (i.e., at least 6 feet) helps to reduce your risk of getting COVID. As mentioned on the Government of Canada website, risk is higher when youre in smaller, crowded or enclosed spaces, where you may be unable to maintain a physical distance from others and practise good hygiene, such as washing your hands. If you are caring for someone with COVID, it is still recommended to maintain at least 6 feet distance. Please see this page for more details here.  You are correct, according to Public Health Ontario masks (including non-medical masks) should be tightly fitting in order to effectively contain the respiratory droplets of the wearer. When considering what type of non-medical mask to use, the fitting and the material of the mask are both important to consider. It says that, \"materials with higher filtration efficiency may offer additional protection\".   We hope this helps provide you with additional information to help keep you and your loved ones safe.      In reply to COVID19 Moderator Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Wednesday, 6 January 2021, 10:03 AM Since the virus would be in the air in an enclosed room or car, would it make sense to get an air sanitizer \" spray\" before people enter the room and afterwards? If yes, any recommendations for Sprays please?     In reply to worried parent Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Wednesday, 6 January 2021, 10:06 AM Sorry I can't edit previous reply. To clarify I meant sprays for the air and not surfaces.     In reply to worried parent Re: Is this \"Breathe Easy\" Mask Enhancer safe? by COVID19 Moderator - Wednesday, 6 January 2021, 2:04 PM Hi worried parent. Thank you for your response. These are very important questions and concerns that many people are currently facing. Thank you for bringing this to the attention of our discussion forum. That being said, we are not public health experts and therefore we are unable to provide government-approved sanitation recommendations or answers related to public health concerns. However, we would like to provide you with this link here, where you can ask public health experts your questions. If you have any mental health symptoms, such as anxiety, related to COVID-19, please do not hesitate to reach out to us here. Thank you!     In reply to COVID19 Moderator Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Thursday, 7 January 2021, 10:48 AM I agree that my questions should be more accurately answered at the CDC ad there is conflicting info.  For example it was mentioned here that the mask should have a \"snug\" fit all round the noise and mouth but in this article here:  \"https://www.hopkinsmedicine.org/health/conditions-and-diseases/coronavirus/coronavirus-face-masks-what-you-need-to-know\"  Your mask should cover your face from the bridge of your nose to under your chin. \"It should be loose fitting\" but secure enough to stay in place.    "
        }
      ],
      [
        {
          "reply_content": "Hi there, first and foremost, thank you for taking the time to do your research in order to protect yourself and/or your loved ones, and for bringing your questions here for others to learn from as well. We not only welcome you to touch on aspects of the article(s), but we encourage you to do so!  With regards to droplets: Naturally produced droplets from humans not only include droplets produced by sneezing and coughing, but they also include droplets produced by breathing as well! Not everyone is aware of this, so I am happy that you asked this question.   With regards to vents/exhalation valves: It is said that, \"Masks with exhalation valves or vents are not recommended. These masks do not protect others from COVID-19 or limit the spread of the virus. This is because they allow infectious respiratory droplets to spread outside the mask.\"  With regards to face shields: It is said that, \"A face shield is used to protect the eyes of the person wearing it. Using a face shield without a mask: won't protect you from potentially inhaling infectious respiratory droplets exhaled by others, and it won't protect others from your infectious respiratory droplets, as they can escape around the face shield\".  Again, we encourage you to continue asking more questions that you may have. Thanks again for bringing your questions to us and we hope to hear back from you!",
          "sub_reply_content": "In reply to COVID19 Moderator Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Tuesday, 5 January 2021, 3:57 PM So guys, hoping you all had a great and safe Holiday [mine was very quiet]. After putting a lot of thought into this and wanting to be as safe as possible I have these questions.  Since the virus would be in the air from an infected person in an enclosed room or car then being 6' apart should not make much difference?  Also, I don't think I have ever seen anyone with a mask which would be tight fitting enough to prevent air from being exchanged so maybe the Gaiter might be the best mask since it should keep the air between your mouth and all the way down the neck?     In reply to worried parent Re: Is this \"Breathe Easy\" Mask Enhancer safe? by COVID19 Moderator - Tuesday, 5 January 2021, 4:52 PM Hi, happy holidays to you as well! Thank you for bringing your thought-provoking questions to us here today.  Wearing proper personal protective equipment (e.g., a mask, gown, face shield etc.) and maintaining physical distance (i.e., at least 6 feet) helps to reduce your risk of getting COVID. As mentioned on the Government of Canada website, risk is higher when youre in smaller, crowded or enclosed spaces, where you may be unable to maintain a physical distance from others and practise good hygiene, such as washing your hands. If you are caring for someone with COVID, it is still recommended to maintain at least 6 feet distance. Please see this page for more details here.  You are correct, according to Public Health Ontario masks (including non-medical masks) should be tightly fitting in order to effectively contain the respiratory droplets of the wearer. When considering what type of non-medical mask to use, the fitting and the material of the mask are both important to consider. It says that, \"materials with higher filtration efficiency may offer additional protection\".   We hope this helps provide you with additional information to help keep you and your loved ones safe.      In reply to COVID19 Moderator Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Wednesday, 6 January 2021, 10:03 AM Since the virus would be in the air in an enclosed room or car, would it make sense to get an air sanitizer \" spray\" before people enter the room and afterwards? If yes, any recommendations for Sprays please?     In reply to worried parent Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Wednesday, 6 January 2021, 10:06 AM Sorry I can't edit previous reply. To clarify I meant sprays for the air and not surfaces.     In reply to worried parent Re: Is this \"Breathe Easy\" Mask Enhancer safe? by COVID19 Moderator - Wednesday, 6 January 2021, 2:04 PM Hi worried parent. Thank you for your response. These are very important questions and concerns that many people are currently facing. Thank you for bringing this to the attention of our discussion forum. That being said, we are not public health experts and therefore we are unable to provide government-approved sanitation recommendations or answers related to public health concerns. However, we would like to provide you with this link here, where you can ask public health experts your questions. If you have any mental health symptoms, such as anxiety, related to COVID-19, please do not hesitate to reach out to us here. Thank you!     In reply to COVID19 Moderator Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Thursday, 7 January 2021, 10:48 AM I agree that my questions should be more accurately answered at the CDC ad there is conflicting info.  For example it was mentioned here that the mask should have a \"snug\" fit all round the noise and mouth but in this article here:  \"https://www.hopkinsmedicine.org/health/conditions-and-diseases/coronavirus/coronavirus-face-masks-what-you-need-to-know\"  Your mask should cover your face from the bridge of your nose to under your chin. \"It should be loose fitting\" but secure enough to stay in place.    "
        }
      ],
      [
        {
          "reply_content": "So guys, hoping you all had a great and safe Holiday [mine was very quiet]. After putting a lot of thought into this and wanting to be as safe as possible I have these questions.  Since the virus would be in the air from an infected person in an enclosed room or car then being 6' apart should not make much difference?  Also, I don't think I have ever seen anyone with a mask which would be tight fitting enough to prevent air from being exchanged so maybe the Gaiter might be the best mask since it should keep the air between your mouth and all the way down the neck?",
          "sub_reply_content": "In reply to worried parent Re: Is this \"Breathe Easy\" Mask Enhancer safe? by COVID19 Moderator - Tuesday, 5 January 2021, 4:52 PM Hi, happy holidays to you as well! Thank you for bringing your thought-provoking questions to us here today.  Wearing proper personal protective equipment (e.g., a mask, gown, face shield etc.) and maintaining physical distance (i.e., at least 6 feet) helps to reduce your risk of getting COVID. As mentioned on the Government of Canada website, risk is higher when youre in smaller, crowded or enclosed spaces, where you may be unable to maintain a physical distance from others and practise good hygiene, such as washing your hands. If you are caring for someone with COVID, it is still recommended to maintain at least 6 feet distance. Please see this page for more details here.  You are correct, according to Public Health Ontario masks (including non-medical masks) should be tightly fitting in order to effectively contain the respiratory droplets of the wearer. When considering what type of non-medical mask to use, the fitting and the material of the mask are both important to consider. It says that, \"materials with higher filtration efficiency may offer additional protection\".   We hope this helps provide you with additional information to help keep you and your loved ones safe.      In reply to COVID19 Moderator Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Wednesday, 6 January 2021, 10:03 AM Since the virus would be in the air in an enclosed room or car, would it make sense to get an air sanitizer \" spray\" before people enter the room and afterwards? If yes, any recommendations for Sprays please?     In reply to worried parent Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Wednesday, 6 January 2021, 10:06 AM Sorry I can't edit previous reply. To clarify I meant sprays for the air and not surfaces.     In reply to worried parent Re: Is this \"Breathe Easy\" Mask Enhancer safe? by COVID19 Moderator - Wednesday, 6 January 2021, 2:04 PM Hi worried parent. Thank you for your response. These are very important questions and concerns that many people are currently facing. Thank you for bringing this to the attention of our discussion forum. That being said, we are not public health experts and therefore we are unable to provide government-approved sanitation recommendations or answers related to public health concerns. However, we would like to provide you with this link here, where you can ask public health experts your questions. If you have any mental health symptoms, such as anxiety, related to COVID-19, please do not hesitate to reach out to us here. Thank you!     In reply to COVID19 Moderator Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Thursday, 7 January 2021, 10:48 AM I agree that my questions should be more accurately answered at the CDC ad there is conflicting info.  For example it was mentioned here that the mask should have a \"snug\" fit all round the noise and mouth but in this article here:  \"https://www.hopkinsmedicine.org/health/conditions-and-diseases/coronavirus/coronavirus-face-masks-what-you-need-to-know\"  Your mask should cover your face from the bridge of your nose to under your chin. \"It should be loose fitting\" but secure enough to stay in place.    "
        }
      ],
      [
        {
          "reply_content": "Hi, happy holidays to you as well! Thank you for bringing your thought-provoking questions to us here today.  Wearing proper personal protective equipment (e.g., a mask, gown, face shield etc.) and maintaining physical distance (i.e., at least 6 feet) helps to reduce your risk of getting COVID. As mentioned on the Government of Canada website, risk is higher when youre in smaller, crowded or enclosed spaces, where you may be unable to maintain a physical distance from others and practise good hygiene, such as washing your hands. If you are caring for someone with COVID, it is still recommended to maintain at least 6 feet distance. Please see this page for more details here.  You are correct, according to Public Health Ontario masks (including non-medical masks) should be tightly fitting in order to effectively contain the respiratory droplets of the wearer. When considering what type of non-medical mask to use, the fitting and the material of the mask are both important to consider. It says that, \"materials with higher filtration efficiency may offer additional protection\".   We hope this helps provide you with additional information to help keep you and your loved ones safe. ",
          "sub_reply_content": "In reply to COVID19 Moderator Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Wednesday, 6 January 2021, 10:03 AM Since the virus would be in the air in an enclosed room or car, would it make sense to get an air sanitizer \" spray\" before people enter the room and afterwards? If yes, any recommendations for Sprays please?     In reply to worried parent Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Wednesday, 6 January 2021, 10:06 AM Sorry I can't edit previous reply. To clarify I meant sprays for the air and not surfaces.     In reply to worried parent Re: Is this \"Breathe Easy\" Mask Enhancer safe? by COVID19 Moderator - Wednesday, 6 January 2021, 2:04 PM Hi worried parent. Thank you for your response. These are very important questions and concerns that many people are currently facing. Thank you for bringing this to the attention of our discussion forum. That being said, we are not public health experts and therefore we are unable to provide government-approved sanitation recommendations or answers related to public health concerns. However, we would like to provide you with this link here, where you can ask public health experts your questions. If you have any mental health symptoms, such as anxiety, related to COVID-19, please do not hesitate to reach out to us here. Thank you!     In reply to COVID19 Moderator Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Thursday, 7 January 2021, 10:48 AM I agree that my questions should be more accurately answered at the CDC ad there is conflicting info.  For example it was mentioned here that the mask should have a \"snug\" fit all round the noise and mouth but in this article here:  \"https://www.hopkinsmedicine.org/health/conditions-and-diseases/coronavirus/coronavirus-face-masks-what-you-need-to-know\"  Your mask should cover your face from the bridge of your nose to under your chin. \"It should be loose fitting\" but secure enough to stay in place.    "
        }
      ],
      [
        {
          "reply_content": "Since the virus would be in the air in an enclosed room or car, would it make sense to get an air sanitizer \" spray\" before people enter the room and afterwards? If yes, any recommendations for Sprays please?",
          "sub_reply_content": "In reply to worried parent Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Wednesday, 6 January 2021, 10:06 AM Sorry I can't edit previous reply. To clarify I meant sprays for the air and not surfaces.     In reply to worried parent Re: Is this \"Breathe Easy\" Mask Enhancer safe? by COVID19 Moderator - Wednesday, 6 January 2021, 2:04 PM Hi worried parent. Thank you for your response. These are very important questions and concerns that many people are currently facing. Thank you for bringing this to the attention of our discussion forum. That being said, we are not public health experts and therefore we are unable to provide government-approved sanitation recommendations or answers related to public health concerns. However, we would like to provide you with this link here, where you can ask public health experts your questions. If you have any mental health symptoms, such as anxiety, related to COVID-19, please do not hesitate to reach out to us here. Thank you!     In reply to COVID19 Moderator Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Thursday, 7 January 2021, 10:48 AM I agree that my questions should be more accurately answered at the CDC ad there is conflicting info.  For example it was mentioned here that the mask should have a \"snug\" fit all round the noise and mouth but in this article here:  \"https://www.hopkinsmedicine.org/health/conditions-and-diseases/coronavirus/coronavirus-face-masks-what-you-need-to-know\"  Your mask should cover your face from the bridge of your nose to under your chin. \"It should be loose fitting\" but secure enough to stay in place.    "
        }
      ],
      [
        {
          "reply_content": "Sorry I can't edit previous reply. To clarify I meant sprays for the air and not surfaces.",
          "sub_reply_content": ""
        }
      ],
      [
        {
          "reply_content": "Hi worried parent. Thank you for your response. These are very important questions and concerns that many people are currently facing. Thank you for bringing this to the attention of our discussion forum. That being said, we are not public health experts and therefore we are unable to provide government-approved sanitation recommendations or answers related to public health concerns. However, we would like to provide you with this link here, where you can ask public health experts your questions. If you have any mental health symptoms, such as anxiety, related to COVID-19, please do not hesitate to reach out to us here. Thank you!",
          "sub_reply_content": "In reply to COVID19 Moderator Re: Is this \"Breathe Easy\" Mask Enhancer safe? by worried parent - Thursday, 7 January 2021, 10:48 AM I agree that my questions should be more accurately answered at the CDC ad there is conflicting info.  For example it was mentioned here that the mask should have a \"snug\" fit all round the noise and mouth but in this article here:  \"https://www.hopkinsmedicine.org/health/conditions-and-diseases/coronavirus/coronavirus-face-masks-what-you-need-to-know\"  Your mask should cover your face from the bridge of your nose to under your chin. \"It should be loose fitting\" but secure enough to stay in place.    "
        }
      ],
      [
        {
          "reply_content": "I agree that my questions should be more accurately answered at the CDC ad there is conflicting info.  For example it was mentioned here that the mask should have a \"snug\" fit all round the noise and mouth but in this article here:  \"https://www.hopkinsmedicine.org/health/conditions-and-diseases/coronavirus/coronavirus-face-masks-what-you-need-to-know\"  Your mask should cover your face from the bridge of your nose to under your chin. \"It should be loose fitting\" but secure enough to stay in place.",
          "sub_reply_content": ""
        }
      ]
    ]
  },
  {
    "url": "https://covid19.camhx.ca/mod/forum/discuss.php?d=109",
    "title": "Feeling Abused by Expectations on LTC Managers & Staff",
    "author": "Mustang Sally",
    "content": "I am becoming more and more frustrated by the expectations the Ministry of LTC, Ministry of Labour and Resident families are putting on the LTC worker.  We have been getting swabbed for testing once a week since November.  Staff come in on days off for no compensation now they are introducing rapid testing which will be 3 x a week yeah.  Our nasal passages will look like someone that has been abusing coke for years.  No other sector is subjected to these invasive test routinely.  I was one of the lucky staff to receive my initial vaccine but now it is day 31 with no word when next dose will come.  I always was taught to follow the drug companies guidelines when taking medication so find this ambiguity very frustrating.",
    "replies": [
      [
        {
          "reply_content": "Hi Mustang Sally, thank you for sharing your experiences with us today. It is normal to feel a bit of frustration with these new protocols, all the changes, and with the ambiguity. It sounds like those who are working with vulnerable populations have to follow more strict protocols, which can be difficult.  I am happy to hear that you were one of the lucky staff members to receive your first dose of the vaccine! Many people who received their first dose of the vaccine have questions about their second dose.   According to the Centre for Disease Control and Prevention (CDC), The second dose should be administered as close to the recommended interval as possible. However, if it is not feasible to adhere to the recommended interval, the second dose of Pfizer-BioNTech and Moderna COVID-19 vaccines may be scheduled for administration up to 6 weeks (42 days) after the first dose. If you have any specific concerns or questions about your second dose, please feel free to ask CDC directly here.   Thank you for being part of the frontline staff at the LTC; it clearly is not an easy task and there is a lot required from managers/staff in hopes to keep everyone safe. ",
          "sub_reply_content": ""
        }
      ]
    ]
  }
]